zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
cy_en_clkpump_divide_t Cy_SysClk_ClkPumpGetDivider(void)
{
    return ((cy_en_clkpump_divide_t)((uint32_t)_FLD2VAL(SRSS_CLK_SELECT_PUMP_DIV, SRSS_CLK_SELECT)));
}

bool Cy_SysClk_ClkPumpIsEnabled(void)
{
    return (_FLD2BOOL(SRSS_CLK_SELECT_PUMP_ENABLE, SRSS_CLK_SELECT));
}

void Cy_SysClk_ClkPumpEnable(void)
{
    SRSS_CLK_SELECT |= SRSS_CLK_SELECT_PUMP_ENABLE_Msk;
}


void Cy_SysClk_ClkPumpDisable(void)
{
    SRSS_CLK_SELECT &= ~SRSS_CLK_SELECT_PUMP_ENABLE_Msk;
}

uint32_t Cy_SysClk_ClkPumpGetFrequency(void)
{
    /* Divide the input frequency down and return the result */
    return (Cy_SysClk_ClkPumpIsEnabled() ?
            (Cy_SysClk_ClkPathGetFrequency((uint32_t)Cy_SysClk_ClkPumpGetSource()) /
             (1UL << (uint32_t)Cy_SysClk_ClkPumpGetDivider())) : 0UL);
}
#endif /* defined (CY_IP_MXS40SSRSS) */
/* ========================================================================== */
/* ==========================    clk_bak SECTION    ========================= */
/* ========================================================================== */

void Cy_SysClk_ClkBakSetSource(cy_en_clkbak_in_sources_t source)
{
    CY_ASSERT_L3(source <= CY_SYSCLK_BAK_IN_PILO);

#if defined (CY_IP_MXS22SRSS)
    BACKUP_CTL = (_CLR_SET_FLD32U(BACKUP_CTL, SRSS_CLK_WCO_CONFIG_CLK_RTC_SEL, (uint32_t) source));
#else
    BACKUP_CTL = (_CLR_SET_FLD32U(BACKUP_CTL, BACKUP_CTL_CLK_SEL, (uint32_t) source));
#endif
}


cy_en_clkbak_in_sources_t Cy_SysClk_ClkBakGetSource(void)
{
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Intentional typecast to cy_en_clkbak_in_sources_t enum.')
#if defined (CY_IP_MXS22SRSS)
    return ((cy_en_clkbak_in_sources_t)_FLD2VAL(SRSS_CLK_WCO_CONFIG_CLK_RTC_SEL, BACKUP_CTL));
#else
    return ((cy_en_clkbak_in_sources_t)_FLD2VAL(BACKUP_CTL_CLK_SEL, BACKUP_CTL));
#endif
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')
}

/* ========================================================================== */
/* ===========================    clkLf SECTION    ========================== */
/* ========================================================================== */

void Cy_SysClk_ClkLfSetSource(cy_en_clklf_in_sources_t source)
{
    CY_ASSERT_L3(source <= CY_SYSCLK_CLKLF_IN_MAX);
    CY_REG32_CLR_SET(SRSS_CLK_SELECT, SRSS_CLK_SELECT_LFCLK_SEL, source);
}


cy_en_clklf_in_sources_t Cy_SysClk_ClkLfGetSource(void)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_clklf_in_sources_t enum.');
    return ((cy_en_clklf_in_sources_t)(_FLD2VAL(SRSS_CLK_SELECT_LFCLK_SEL, SRSS_CLK_SELECT)));
}

#if ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION == 2)) && \
    (defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u)))
uint32_t Cy_SysClk_ClkLfGetFrequency(void)
{
    uint32_t freq = 0UL;

    cy_en_clklf_in_sources_t source = Cy_SysClk_ClkLfGetSource();

    /* Get the frequency of the source  */
    switch(source)
     {
#if (defined (SRSS_PILO_PRESENT) && (SRSS_PILO_PRESENT == 1u))
        case CY_SYSCLK_CLKLF_IN_PILO:
            freq = (0UL != (SRSS_CLK_PILO_CONFIG & SRSS_CLK_PILO_CONFIG_PILO_EN_Msk)) ? CY_SYSCLK_PILO_FREQ : 0UL;
            break;
#endif /* (defined (SRSS_PILO_PRESENT) && (SRSS_PILO_PRESENT == 1u)) */

        case CY_SYSCLK_CLKLF_IN_WCO:
            freq = (Cy_SysClk_WcoOkay()) ? CY_SYSCLK_WCO_FREQ : 0UL;
            break;

        case CY_SYSCLK_CLKLF_IN_ILO:
            freq = (0UL != (SRSS_CLK_ILO_CONFIG & SRSS_CLK_ILO_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;

#if (defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u))
        case CY_SYSCLK_CLKLF_IN_ILO1:
            freq = (0UL != (SRSS_CLK_ILO1_CONFIG & SRSS_CLK_ILO1_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;
#endif /* (defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u))*/

#if (defined (SRSS_ECO_PRESENT) && (SRSS_ECO_PRESENT == 1u))
        case CY_SYSCLK_CLKLF_IN_ECO_PRESCALER:
            freq = Cy_SysClk_EcoPrescaleGetFrequency();
            break;
#endif /* (defined (SRSS_ECO_PRESENT) && (SRSS_ECO_PRESENT == 1u))*/

        default:
            /* Don't know the frequency of dsi_out, leave freq = 0UL */
            break;
     }
    return (freq);
 }
 #endif /* ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION == 2)) && \
    (defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u))) */

#if defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
uint32_t Cy_SysClk_ClkLfGetFrequency(void)
{
    uint32_t freq = 0UL;

    cy_en_clklf_in_sources_t source = Cy_SysClk_ClkLfGetSource();

    /* Get the frequency of the source  */
    switch(source)
     {
#if (!(defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)))
        case CY_SYSCLK_CLKLF_IN_PILO:
            freq = (0UL != (SRSS_CLK_PILO_CONFIG & SRSS_CLK_PILO_CONFIG_PILO_EN_Msk)) ? CY_SYSCLK_PILO_FREQ : 0UL;
            break;
#endif /* if (!(defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))) */

        case CY_SYSCLK_CLKLF_IN_WCO:
            freq = (Cy_SysClk_WcoOkay()) ? CY_SYSCLK_WCO_FREQ : 0UL;
            break;

        case CY_SYSCLK_CLKLF_IN_ILO:
            freq = (0UL != (SRSS_CLK_ILO_CONFIG & SRSS_CLK_ILO_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;

#if ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)))
        case CY_SYSCLK_CLKLF_IN_ILO1:
            freq = (0UL != (SRSS_CLK_ILO1_CONFIG & SRSS_CLK_ILO1_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;
#endif /* if ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))) */

        case CY_SYSCLK_CLKLF_IN_ECO_PRESCALER:
            freq = Cy_SysClk_EcoPrescaleGetFrequency();
            break;

        default:
            /* Don't know the frequency of dsi_out, leave freq = 0UL */
            break;
     }
    return (freq);
 }


#if defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) && defined(SRSS_CSV_LF_CSV_REF_CTL))
uint32_t Cy_SysClk_ClkLfCsvGetRefFrequency(cy_en_clklf_csv_ref_clk_t refClk)
 {
    uint32_t freq = 0UL;

    /* Get the frequency of the source  */
    switch(refClk)
     {
 #if defined (CY_IP_MXS22SRSS)
        case CY_SYSCLK_CLKLF_CSV_REF_PILO:
            freq = (0UL != (SRSS_CLK_PILO_CONFIG & SRSS_CLK_PILO_CONFIG_PILO_EN_Msk)) ? CY_SYSCLK_PILO_FREQ : 0UL;
            break;

        case CY_SYSCLK_CLKLF_CSV_REF_ILO:
            freq = (0UL != (SRSS_CLK_ILO_CONFIG & SRSS_CLK_ILO_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;

        case CY_SYSCLK_CLKLF_CSV_REF_WCO:
            freq = (Cy_SysClk_WcoOkay()) ? CY_SYSCLK_WCO_FREQ : 0UL;
            break;

