zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
#elif (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
        case CY_SYSCLK_CLKLF_CSV_REF_ILO0:
            freq = (0UL != (SRSS_CLK_ILO0_CONFIG & SRSS_CLK_ILO0_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;

        case CY_SYSCLK_CLKLF_CSV_REF_ILO1:
            freq = (0UL != (SRSS_CLK_ILO1_CONFIG & SRSS_CLK_ILO1_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;

#else
        case CY_SYSCLK_CLKLF_CSV_REF_IMO: /* The IMO frequency is fixed at 8 MHz */
            freq = CY_SYSCLK_IMO_FREQ;
            break;

        case CY_SYSCLK_CLKLF_CSV_REF_EXT:
            freq = Cy_SysClk_ExtClkGetFrequency();
            break;

        case CY_SYSCLK_CLKLF_CSV_REF_ECO:
            freq = Cy_SysClk_EcoGetFrequency();
            break;

        case CY_SYSCLK_CLKLF_CSV_REF_IHO:
            freq = (Cy_SysClk_IhoIsEnabled()) ? CY_SYSCLK_IHO_FREQ : 0UL;
            break;
#endif
        default:
            /* Don't know the frequency of dsi_out, leave freq = 0UL */
            break;
     }
    return (freq);
 }


cy_en_sysclk_status_t Cy_SysClk_ClkLfCsvManualConfigure(cy_en_clklf_csv_ref_clk_t refClk, const cy_stc_clklf_csv_manual_config_t * csvConfig)
{
    /* Check for errors */
    CY_ASSERT_L1(csvConfig != NULL);

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint32_t monitorFreq = Cy_SysClk_ClkLfGetFrequency();
    uint32_t refFreq = Cy_SysClk_ClkLfCsvGetRefFrequency(refClk);
    float32_t f_monitorFreq = (float32_t) monitorFreq;
    float32_t f_refFreq = (float32_t) refFreq;

    CY_ASSERT_L1(csvConfig->upperLimit > CSV_MIN_TARGET_VAL);
    CY_ASSERT_L1(csvConfig->lowerLimit < csvConfig->upperLimit -1UL);
    CY_ASSERT_L1(monitorFreq > 0UL);
    CY_ASSERT_L1((int32_t) csvConfig->startTime >= (((int32_t)(((float32_t)(csvConfig->period +3UL)) * (f_refFreq / f_monitorFreq))) - ((int32_t)csvConfig->upperLimit)));
    (void) monitorFreq; /* Used only in Assert comparison. */
    (void) refFreq;  /* Used only in Assert comparison.  */
    (void) f_monitorFreq; /* Used only in Assert comparison. */
    (void) f_refFreq;  /* Used only in Assert comparison.  */

#if defined (CY_IP_MXS22SRSS) && defined (SRSS_CSV_LF_REF_SEL)
    CY_REG32_CLR_SET(SRSS_CSV_LF_REF_SEL, SRSS_CSV_LF_REF_SEL_LF_REF_MUX, refClk);
#elif (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL))
    CY_REG32_CLR_SET(SRSS_CSV_REF_SEL, SRSS_CSV_REF_SEL_REF_MUX, refClk);
#endif

    CY_REG32_CLR_SET(SRSS_CSV_LF_CSV_REF_CTL, CSV_LF_CSV_REF_CTL_CSV_STARTUP, csvConfig->startTime - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_LF_CSV_REF_LIMIT, CSV_LF_CSV_REF_LIMIT_CSV_LOWER, csvConfig->lowerLimit - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_LF_CSV_REF_LIMIT, CSV_LF_CSV_REF_LIMIT_CSV_UPPER, csvConfig->upperLimit - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_LF_CSV_MON_CTL, CSV_LF_CSV_MON_CTL_CSV_PERIOD, csvConfig->period - 1UL);
    retVal = CY_SYSCLK_SUCCESS;

    return retVal;
}


cy_en_sysclk_status_t Cy_SysClk_ClkLfCsvConfigure(cy_en_clklf_csv_ref_clk_t refClk, uint32_t accuracy)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    cy_stc_clklf_csv_manual_config_t csvConfig= {0, 0, 0, 0};

    uint32_t target = CSV_MIN_TARGET_VAL;
    uint32_t monitorFreq = Cy_SysClk_ClkLfGetFrequency();
    uint32_t refFreq = Cy_SysClk_ClkLfCsvGetRefFrequency(refClk);
    float32_t f_monitorFreq = (float32_t) monitorFreq;
    float32_t f_refFreq = (float32_t) refFreq;

    CY_ASSERT_L1(monitorFreq > 0UL);

    if(monitorFreq > 0UL && refFreq > 0UL)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.lowerLimit = target - (uint32_t) (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F));
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.upperLimit = target + (uint32_t) (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F));
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.period =  (uint32_t) ((float32_t)target / (f_refFreq / f_monitorFreq));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.startTime = (uint32_t) ((((float32_t)(csvConfig.period + 3UL)) * (f_refFreq / f_monitorFreq))
                                + (CSV_MIN_STARTUP_DELAY * f_refFreq)
                                + (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F))) + 1U;

        retVal= Cy_SysClk_ClkLfCsvManualConfigure(refClk, &csvConfig);
    }

    return retVal;
}


void Cy_SysClk_ClkLfCsvEnable(void)
{
    CY_REG32_CLR_SET(SRSS_CSV_LF_CSV_REF_CTL, CSV_LF_CSV_REF_CTL_CSV_EN, 1U);
}


void Cy_SysClk_ClkLfCsvDisable(void)
{
    CY_REG32_CLR_SET(SRSS_CSV_LF_CSV_REF_CTL, CSV_LF_CSV_REF_CTL_CSV_EN, 0U);
}


bool Cy_SysClk_IsClkLfCsvEnabled(void)
{
    return (0UL != (SRSS_CSV_LF_CSV_REF_CTL & CSV_LF_CSV_REF_CTL_CSV_EN_Msk));
}
#endif /* defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) && defined(SRSS_CSV_LF_CSV_REF_CTL)) */
#endif


/* ========================================================================== */
/* ========================    clk_peri SECTION    ========================== */
/* ========================================================================== */

#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)

uint32_t Cy_SysClk_ClkPeriGetFrequency(void)
{
    uint32_t locFreq = Cy_SysClk_ClkHfGetFrequency(0UL); /* Get root frequency */
    uint32_t locDiv = 1UL + (uint32_t)Cy_SysClk_ClkPeriGetDivider(); /* peri prescaler (1-256) */

    /* Divide the path input frequency down and return the result */
    return (CY_SYSLIB_DIV_ROUND(locFreq, locDiv));
}

void Cy_SysClk_ClkPeriSetDivider(uint8_t divider)
{
#if defined (CY_IP_M7CPUSS)
    CY_REG32_CLR_SET(CPUSS_PERI_CLOCK_CTL, CPUSS_PERI_CLOCK_CTL_INT_DIV, divider);
#elif defined (CY_IP_M4CPUSS)
    CY_REG32_CLR_SET(CPUSS_CM0_CLOCK_CTL, CPUSS_CM0_CLOCK_CTL_PERI_INT_DIV, divider);
#else
    #error "Unsupported Core Type"
#endif
}

