zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
    if (clkHfMask != 0UL)
    {
        while (clkHfMask != 0UL)
        {
            if ((clkHfMask & 1UL) != 0UL)
            {
                /* disable/disable root selection and enable clock path */
                (void)Cy_SysClk_ClkHfSetDivider(clkHf, divider);
            }
            clkHfMask = clkHfMask >> 1;
            clkHf++;
        }
    }
}

void Cy_SysClk_ClkHfEnableDirectMuxWithMask(uint32_t clkHfMask, bool enable)
{
  uint32_t clkHf = 0UL;

  if (clkHfMask != 0UL)
  {
    while (clkHfMask != 0UL)
    {
      if ((clkHfMask & 1UL) != 0UL)
      {
        /* disable/disable root selection and enable clock path */
        (void)Cy_SysClk_ClkHfDirectSel(clkHf, enable);
      }
      clkHfMask = clkHfMask >> 1;
      clkHf++;
    }
  }
}
#endif /*  defined (CY_IP_MXS22SRSS) */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)

cy_en_sysclk_status_t Cy_SysClk_ClkHfDirectSel(uint32_t clkHf, bool enable)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    if (clkHf < CY_SRSS_NUM_HFROOT)
    {
        CY_REG32_CLR_SET(SRSS_CLK_DIRECT_SELECT[clkHf], SRSS_CLK_DIRECT_SELECT_DIRECT_MUX, !(enable));
        retVal = CY_SYSCLK_SUCCESS;
    }
    return (retVal);
}

bool Cy_SysClk_IsClkHfDirectSelEnabled(uint32_t clkHf)
{
    bool retVal = false;
    if (clkHf < CY_SRSS_NUM_HFROOT)
    {
        return !(_FLD2BOOL(SRSS_CLK_DIRECT_SELECT_DIRECT_MUX, SRSS_CLK_DIRECT_SELECT[clkHf]));
    }
    return (retVal);
}

#elif (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
cy_en_sysclk_status_t Cy_SysClk_ClkHfDirectSel(uint32_t clkHf, bool enable)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    if (clkHf < CY_SRSS_NUM_HFROOT)
    {
        CY_REG32_CLR_SET(SRSS_CLK_ROOT_SELECT[clkHf], SRSS_CLK_ROOT_SELECT_DIRECT_MUX, !(enable));
        retVal = CY_SYSCLK_SUCCESS;
    }
    return (retVal);
}

bool Cy_SysClk_IsClkHfDirectSelEnabled(uint32_t clkHf)
{
    bool retVal = false;
    if (clkHf < CY_SRSS_NUM_HFROOT)
    {
        return !(_FLD2BOOL(SRSS_CLK_ROOT_SELECT_DIRECT_MUX, SRSS_CLK_ROOT_SELECT[clkHf]));
    }
    return (retVal);
}

#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) */

#if defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) && defined(SRSS_CSV_HF_CSV_REF_CTL))
uint32_t Cy_SysClk_ClkHfCsvGetRefFrequency(cy_en_clkhf_csv_ref_clk_t refClk)
 {
    uint32_t freq = 0UL;

    /* Get the frequency of the source  */
    switch(refClk)
     {
        case CY_SYSCLK_CLKHF_CSV_REF_IMO: /* The IMO frequency is fixed at 8 MHz */
            freq = CY_SYSCLK_IMO_FREQ;
            break;

        case CY_SYSCLK_CLKHF_CSV_REF_EXT:
            freq = Cy_SysClk_ExtClkGetFrequency();
            break;

        case CY_SYSCLK_CLKHF_CSV_REF_ECO:
            freq = Cy_SysClk_EcoGetFrequency();
            break;

#if !(defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
        case CY_SYSCLK_CLKHF_CSV_REF_IHO:
            freq = (Cy_SysClk_IhoIsEnabled()) ? CY_SYSCLK_IHO_FREQ : 0UL;
            break;
#endif /* !(defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) */

        default:
            /* Don't know the frequency of dsi_out, leave freq = 0UL */
            break;
     }
    return (freq);
 }


cy_en_sysclk_status_t Cy_SysClk_ClkHfCsvManualConfigure(const cy_stc_clkhf_csv_hf_config_t * hfConfig, const cy_stc_clkhf_csv_manual_config_t * csvConfig)
{
    /* Check for errors */
    CY_ASSERT_L1(hfConfig != NULL);
    CY_ASSERT_L1(csvConfig != NULL);
    CY_ASSERT_L1(hfConfig->clkHf < CY_SRSS_NUM_HFROOT);

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint32_t monitorFreq = Cy_SysClk_ClkHfGetFrequency(hfConfig->clkHf);
    uint32_t refFreq = Cy_SysClk_ClkHfCsvGetRefFrequency(hfConfig->refClk);
    float32_t f_monitorFreq = (float32_t) monitorFreq;
    float32_t f_refFreq = (float32_t) refFreq;

    CY_ASSERT_L1(csvConfig->upperLimit > CSV_MIN_TARGET_VAL);
    CY_ASSERT_L1(csvConfig->lowerLimit < csvConfig->upperLimit -1U);
    CY_ASSERT_L1((int32_t) csvConfig->startTime >= (((int32_t)(((float32_t)(csvConfig->period +3UL)) * (f_refFreq / f_monitorFreq))) - ((int32_t)csvConfig->upperLimit)));

    (void) monitorFreq; /* Used only in Assert comparison. */
    (void) refFreq;  /* Used only in Assert comparison.  */
    (void) f_monitorFreq; /* Used only in Assert comparison. */
    (void) f_refFreq;  /* Used only in Assert comparison.  */

    if(hfConfig->clkHf < CY_SRSS_NUM_HFROOT)
    {
        CY_REG32_CLR_SET(SRSS_CSV_REF_SEL, SRSS_CSV_REF_SEL_REF_MUX, hfConfig->refClk);
        CY_REG32_CLR_SET(SRSS_CSV_HF_CSV_REF_CTL(hfConfig->clkHf), CSV_HF_CSV_REF_CTL_CSV_STARTUP, csvConfig->startTime - 1UL);
        CY_REG32_CLR_SET(SRSS_CSV_HF_CSV_REF_LIMIT(hfConfig->clkHf), CSV_HF_CSV_REF_LIMIT_CSV_LOWER, csvConfig->lowerLimit - 1UL);
        CY_REG32_CLR_SET(SRSS_CSV_HF_CSV_REF_LIMIT(hfConfig->clkHf), CSV_HF_CSV_REF_LIMIT_CSV_UPPER, csvConfig->upperLimit - 1UL);
        CY_REG32_CLR_SET(SRSS_CSV_HF_CSV_MON_CTL(hfConfig->clkHf), CSV_HF_CSV_MON_CTL_CSV_PERIOD, csvConfig->period - 1UL);
        retVal = CY_SYSCLK_SUCCESS;
    }

    return retVal;
}


cy_en_sysclk_status_t Cy_SysClk_ClkHfCsvConfigure(const cy_stc_clkhf_csv_hf_config_t * hfConfig, uint32_t accuracy)
{
    CY_ASSERT_L1(hfConfig != NULL);
    CY_ASSERT_L1(hfConfig->clkHf < CY_SRSS_NUM_HFROOT);

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    cy_stc_clkhf_csv_manual_config_t csvConfig= {0, 0, 0, 0};

    if(hfConfig->clkHf < CY_SRSS_NUM_HFROOT)
    {
        uint32_t target = CSV_MIN_TARGET_VAL;
        uint32_t monitorFreq = Cy_SysClk_ClkHfGetFrequency(hfConfig->clkHf);
        uint32_t refFreq = Cy_SysClk_ClkHfCsvGetRefFrequency(hfConfig->refClk);
        float32_t f_monitorFreq = (float32_t) monitorFreq;
        float32_t f_refFreq = (float32_t) refFreq;
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.lowerLimit = (uint32_t) ((float32_t)target - (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F)));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.upperLimit = (uint32_t) ((float32_t)target + (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F)));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.period =  (uint32_t) (((float32_t) target) / (f_refFreq / f_monitorFreq));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.startTime = (uint32_t) ((((float32_t)(csvConfig.period + 3UL)) * (f_refFreq / f_monitorFreq))
                                + (CSV_MIN_STARTUP_DELAY * f_refFreq)
                                + (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F))) + 1U;

