zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
#if defined (CY_IP_MXS28SRSS)
void Cy_SysClk_WcoGainControl(cy_en_wco_gain_ctrl_modes_t gmMode)
{
    CY_REG32_CLR_SET(BACKUP_WCO_CTL, BACKUP_WCO_CTL_GM, gmMode);
}
#endif /* defined (CY_IP_MXS28SRSS) */

void Cy_SysClk_WcoBypass(cy_en_wco_bypass_modes_t bypass)
{
#if defined (CY_IP_MXS28SRSS)
    CY_REG32_CLR_SET(BACKUP_WCO_CTL, BACKUP_WCO_CTL_WCO_BYP_EN, bypass);
#elif defined (CY_IP_MXS22SRSS)
    CY_REG32_CLR_SET(BACKUP_CTL, SRSS_CLK_WCO_CONFIG_WCO_BYPASS, bypass);
#else
    CY_REG32_CLR_SET(BACKUP_CTL, BACKUP_CTL_WCO_BYPASS, bypass);
#endif
}

/* ========================================================================== */
/* ===========================    PILO SECTION    =========================== */
/* ========================================================================== */

#define CY_SYSCLK_PILO_STARTUP_DELAY 250U
#define CY_SYSCLK_PILO_TEST_COUNT 10U
#define CY_SYSCLK_PILO_TEST_DELAY 100U

void Cy_SysClk_PiloEnable(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (0U != CY_SRSS_PILO_PRESENT))
    SRSS_CLK_PILO_CONFIG |= SRSS_CLK_PILO_CONFIG_PILO_EN_Msk; /* 1 = enable */
#endif

    /* Max 150us is needed for PILO Startup */
    Cy_SysLib_DelayUs(CY_SYSCLK_PILO_STARTUP_DELAY);
}
#if defined (CY_IP_MXS40SSRSS)
void Cy_SysClk_PiloBackupEnable(void)
{
#if defined (CY_SRSS_PILO_PRESENT) && (0U != CY_SRSS_PILO_PRESENT)
    SRSS_CLK_PILO_CONFIG |= SRSS_CLK_PILO_CONFIG_PILO_BACKUP_Msk; /* 1 = enable */
#endif
}

void Cy_SysClk_PiloBackupDisable(void)
{
#if defined (CY_SRSS_PILO_PRESENT) && (0U != CY_SRSS_PILO_PRESENT)
    /* Clear PILO_BACKUP bitfields. */
    SRSS_CLK_PILO_CONFIG &= (uint32_t)~(SRSS_CLK_PILO_CONFIG_PILO_BACKUP_Msk);
#endif
}
#endif

#if defined (CY_IP_MXS40SSRSS)
void Cy_SysClk_PiloTcscEnable(void)
{
#if (CY_SRSS_PILO_PRESENT)
    SRSS_CLK_PILO_CONFIG |= SRSS_CLK_PILO_CONFIG_PILO_TCSC_EN_Msk; /* 1 = enable */
#endif
}

void Cy_SysClk_PiloTcscDisable(void)
{
#if (CY_SRSS_PILO_PRESENT)
    /* Clear PILO_TCSC_EN( Second order temperature curvature correction.) bitfields. */
    SRSS_CLK_PILO_CONFIG &= (uint32_t)~(SRSS_CLK_PILO_CONFIG_PILO_TCSC_EN_Msk);
#endif
}

bool Cy_SysClk_PiloOkay(void)
{
#if (CY_SRSS_PILO_PRESENT)
    SRSS_CLK_OUTPUT_FAST = SLOW_SEL_OUTPUT_INDEX;
    SRSS_CLK_OUTPUT_SLOW = (uint32_t)CY_SYSCLK_MEAS_CLK_PILO;
    SRSS_CLK_CAL_CNT1 = CY_SYSCLK_PILO_TEST_COUNT;

    /* Wait atleast two PILO clock cycles before reading CAL_CLK1_PRESENT bit */
    Cy_SysLib_DelayUs(CY_SYSCLK_PILO_TEST_DELAY);

    return (_FLD2BOOL(SRSS_CLK_CAL_CNT1_CAL_CLK1_PRESENT, SRSS_CLK_CAL_CNT1));
#else
    return false;
#endif
}
#endif /* defined (CY_IP_MXS40SSRSS) */

bool Cy_SysClk_PiloIsEnabled(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (0U != CY_SRSS_PILO_PRESENT))
    return (_FLD2BOOL(SRSS_CLK_PILO_CONFIG_PILO_EN, SRSS_CLK_PILO_CONFIG));
#else
    return false;
#endif
}

void Cy_SysClk_PiloDisable(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (0U != CY_SRSS_PILO_PRESENT))
    /* Clear PILO_EN */
    SRSS_CLK_PILO_CONFIG &= (uint32_t)~(SRSS_CLK_PILO_CONFIG_PILO_EN_Msk);
#endif
}

/* ========================================================================== */
/* ==========================    ALTHF SECTION    =========================== */
/* ========================================================================== */
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS)
uint32_t Cy_SysClk_AltHfGetFrequency(void)
{
    #if defined (CY_IP_MXS40BLE52SS)
        return Cy_BTSS_GetXtalOscFreq();
    #else
        return (0UL);
    #endif /* CY_IP_MXS40BLE52SS */
}

cy_en_sysclk_status_t Cy_SysClk_AltHfEnable(uint32_t timeoutus)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_TIMEOUT;

    CY_UNUSED_PARAMETER(timeoutus);
#if (defined (CY_SRSS_ALTHF_PRESENT) && (CY_SRSS_ALTHF_PRESENT == 1U))
    /* Enable ALTHF */
    SRSS_CLK_ALTHF_CTL |= SRSS_CLK_ALTHF_CTL_ALTHF_ENABLE_Msk;

    /* now do the timeout for ALTHF to be enabled  */
    for (; (Cy_SysClk_IsAltHfEnabled() == false) && (0UL != timeoutus); timeoutus--)
    {
        Cy_SysLib_DelayUs(1U);
    }

    if (0UL != timeoutus)
    {
        retVal = CY_SYSCLK_SUCCESS;
    }
#endif

    return (retVal);
}

bool Cy_SysClk_IsAltHfEnabled(void)
{
#if (defined (CY_SRSS_ALTHF_PRESENT) && (CY_SRSS_ALTHF_PRESENT == 1U))
    return (_FLD2BOOL(SRSS_CLK_ALTHF_CTL_ALTHF_ENABLED, SRSS_CLK_ALTHF_CTL));
#else
    return false;
#endif
}

#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) */
/* ========================================================================== */
/* ==========================    ALTLF SECTION    =========================== */
/* ========================================================================== */


uint32_t Cy_SysClk_AltLfGetFrequency(void)
{
    return (0UL);
}


bool Cy_SysClk_AltLfIsEnabled(void)
{
    return (false);
}


/* ========================================================================== */
/* ===========================    ILO SECTION    ============================ */
/* ========================================================================== */

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))


/* Below ILO API's are valid for both ILO0 and ILO1 */
void Cy_SysClk_IloSrcEnable(uint32_t iloNum)
{
    CY_ASSERT_L1(iloNum < CY_SRSS_ILO_COUNT);

    if (0UL == iloNum)
    {
        SRSS_CLK_ILO0_CONFIG |= SRSS_CLK_ILO0_CONFIG_ENABLE_Msk;
    }
    else
    {
        SRSS_CLK_ILO1_CONFIG |= SRSS_CLK_ILO1_CONFIG_ENABLE_Msk;
    }
}

cy_en_sysclk_status_t Cy_SysClk_IloSrcDisable(uint32_t iloNum)
{
    CY_ASSERT_L1(iloNum < CY_SRSS_ILO_COUNT);
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;

    if (0UL == iloNum)
    {
        if (!_FLD2BOOL(WDT_CTL_ENABLED, SRSS_WDT_CTL)) /* if disabled */
        {
            SRSS_CLK_ILO0_CONFIG &= ~SRSS_CLK_ILO0_CONFIG_ENABLE_Msk;
            retVal = CY_SYSCLK_SUCCESS;
        }
    }
    else
    {
        SRSS_CLK_ILO1_CONFIG &= ~SRSS_CLK_ILO1_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_SUCCESS;
    }
    return (retVal);
}

