zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
bool Cy_SysClk_IloSrcIsEnabled(uint32_t iloNum)
{
    CY_ASSERT_L1(iloNum < CY_SRSS_ILO_COUNT);

    if (0UL == iloNum)
    {
        return (_FLD2BOOL(SRSS_CLK_ILO0_CONFIG_ENABLE, SRSS_CLK_ILO0_CONFIG));
    }
    else
    {
        return (_FLD2BOOL(SRSS_CLK_ILO1_CONFIG_ENABLE, SRSS_CLK_ILO1_CONFIG));
    }
}

void Cy_SysClk_IloSrcHibernateOn(uint32_t iloNum, bool on)
{
    if (0UL == iloNum)
    {
        CY_REG32_CLR_SET(SRSS_CLK_ILO0_CONFIG, SRSS_CLK_ILO0_CONFIG_ILO0_BACKUP, ((on) ? 1UL : 0UL));
    }
}

#elif (defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS))
void Cy_SysClk_IloEnable(void)
{
#if (CY_SRSS_ILO_PRESENT)
    SRSS_CLK_ILO_CONFIG |= SRSS_CLK_ILO_CONFIG_ENABLE_Msk;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_IloDisable(void)
{
#if (CY_SRSS_ILO_PRESENT)
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;
    if (!_FLD2BOOL(SRSS_WDT_CTL_WDT_EN, SRSS_WDT_CTL)) /* if disabled */
    {
        SRSS_CLK_ILO_CONFIG &= ~SRSS_CLK_ILO_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_SUCCESS;
    }
    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}

bool Cy_SysClk_IloIsEnabled(void)
{
#if (CY_SRSS_ILO_PRESENT)
    return (_FLD2BOOL(SRSS_CLK_ILO_CONFIG_ENABLE, SRSS_CLK_ILO_CONFIG));
#else
    return false;
#endif
}

void Cy_SysClk_IloHibernateOn(bool on)
{
    CY_UNUSED_PARAMETER(on);
#if (CY_SRSS_ILO_PRESENT)
    CY_REG32_CLR_SET(SRSS_CLK_ILO_CONFIG, SRSS_CLK_ILO_CONFIG_ILO_BACKUP, ((on) ? 1UL : 0UL));
#endif
}

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) */


/* ========================================================================== */
/* =========================    EXTCLK SECTION    =========================== */
/* ========================================================================== */


    static uint32_t cySysClkExtFreq = 0UL;

#if defined (SRSS_HT_VARIANT)
#define CY_SYSCLK_EXTCLK_MAX_FREQ (80000000UL) /* 80 MHz */
#else
#define CY_SYSCLK_EXTCLK_MAX_FREQ (100000000UL) /* 100 MHz */
#endif


void Cy_SysClk_ExtClkSetFrequency(uint32_t freq)
{
    if (freq <= CY_SYSCLK_EXTCLK_MAX_FREQ)
    {
        cySysClkExtFreq = freq;
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_ExtClkGetFrequency
****************************************************************************//**
*
* Returns the frequency of the External Clock Source (EXTCLK) from the
* internal storage.
*
* \return The frequency of the External Clock Source.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ExtClkSetFrequency
*
*******************************************************************************/
uint32_t Cy_SysClk_ExtClkGetFrequency(void)
{
    return (cySysClkExtFreq);
}

/* ========================================================================== */
/* ===========================    ECO SECTION    ============================ */
/* ========================================================================== */

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_IP_MXS22SRSS) || \
    (defined (CY_IP_MXS40SSRSS) && (SRSS_ECO_PRESENT == 1UL))
#if (CY_SRSS_ECO_PRESENT)
static uint32_t ecoFrequency = 0UL; /* Internal storage for ECO frequency user setting */
#endif

#define CY_SYSCLK_INVALID_TRIM_VALUE (0xFFFFFFFFUL)

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || (defined (CY_IP_MXS40SSRSS) && (SRSS_ECO_PRESENT == 1UL))

#define M_PI (3.1415927f)

/** \cond *********************************************************************
* Function Name: cy_sqrt
* Calculates square root.
* The input is 32-bit wide.
* The result is 16-bit wide.
*******************************************************************************/
static uint32_t cy_sqrt(uint32_t x);
static uint32_t cy_sqrt(uint32_t x)
{
    uint32_t i;
    uint32_t res = 0UL;
    uint32_t add = 0x8000UL;

    for(i = 0UL; i < 16UL; i++)
    {
        uint32_t tmp = res | add;

        if (x >= (tmp * tmp))
        {
            res = tmp;
        }

        add >>= 1U;
    }

    return (res);
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoAtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for ATRIM bits in register CLK_ECO_CONFIG2.
*   max amplitude (Vp) |   ATRIM value
*   Below configuration is for CAT1C devices
*      0.50[V] <= Vp < 0.55[V]    |      0x04
*      0.55[V] <= Vp < 0.55[V]    |      0x05
*      0.60[V] <= Vp < 0.65[V]    |      0x06
*      0.65[V] <= Vp < 0.65[V]    |      0x07
*      0.70[V] <= Vp < 0.75[V]    |      0x08
*      0.75[V] <= Vp < 0.75[V]    |      0x09
*      0.80[V] <= Vp < 0.85[V]    |      0x0A
*      0.85[V] <= Vp < 0.75[V]    |      0x0B
*      0.90[V] <= Vp < 0.95[V]    |      0x0C
*      0.95[V] <= Vp < 1.00[V]    |      0x0D
*      1.00[V] <= Vp < 1.05[V]    |      0x0E
*      1.05[V] <= Vp < 1.10[V]    |      0x0F
*      1.10[V] <= Vp              |      0x00
*
* Below configuration is for CAT1B(B2) devices
*      150[mV] = Vp               |      0x0
*      175[mV] = Vp               |      0x1
*      200[mV] = Vp               |      0x2
*      225[mV] = Vp               |      0x3
*      250[mV] = Vp               |      0x4
*      275[mV] = Vp               |      0x5
*      300[mV] = Vp               |      0x6
*      325[mV] = Vp               |      0x7
*      350[mV] = Vp               |      0x8
*      375[mV] = Vp               |      0x9
*      400[mV] = Vp               |      0xA
*      425[mV] = Vp               |      0xB
*      450[mV] = Vp               |      0xC
*      475[mV] = Vp               |      0xD
*      500[mV] = Vp               |      0xE
*      525[mV] = Vp               |      0xF
*
*   \param maxAmplitude: Max amplitude (Vp) calculated by below formula.
*         Vpp = 1,000 * sqrt(drivelevel / 2 / esr) / 3.14 / freqMHz / cLoad
*
*   \return : value to be set to ATRIM.
*             It returns 0xFFFFFFFF, when there are no proper value.
*
*******************************************************************************/

__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoAtrim(float32_t maxAmplitude)
{
    if(maxAmplitude < 0.50f)
    {
        return (CY_SYSCLK_INVALID_TRIM_VALUE);
    }

    if((0.50f <= maxAmplitude) && (maxAmplitude < 0.55f))
    {
        return(0x04UL);
    }
    else if(maxAmplitude < 0.60f)
    {
        return(0x05UL);
    }
    else if(maxAmplitude < 0.65f)
    {
        return(0x06UL);
    }
    else if(maxAmplitude < 0.70f)
    {
        return(0x07UL);
    }
    else if(maxAmplitude < 0.75f)
    {
        return(0x08UL);
    }
    else if(maxAmplitude < 0.80f)
    {
        return(0x09UL);
    }
    else if(maxAmplitude < 0.85f)
    {
        return(0x0AUL);
    }
    else if(maxAmplitude < 0.90f)
    {
        return(0x0BUL);
    }
    else if(maxAmplitude < 0.95f)
    {
        return(0x0CUL);
    }
    else if(maxAmplitude < 1.00f)
    {
        return(0x0DUL);
    }
    else if(maxAmplitude < 1.05f)
    {
        return(0x0EUL);
    }
    else if(maxAmplitude < 1.10f)
    {
        return(0x0FUL);
    }
    else if(1.1f <= maxAmplitude)
    {
        return(0x00UL);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

