zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoAGCEN
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for AGC_EN bits in register CLK_ECO_CONFIG.
*   max amplitude (Vp) |   ATRIM value
*      0.50[V] <= Vp < 1.10[V]    |      0x00
*      1.10[V] <= Vp              |      0x01
*
*   \param maxAmplitude: Max amplitude (Vp) calculated by below formula.
*         Vpp = 1,000 * sqrt(drivelevel / 2 / esr) / 3.14 / freqMHz / cLoad
*
*   \return : value to be set to AGC_EN.
*             It returns 0xFFFFFFFF, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoAGCEN(float32_t maxAmplitude)
{
    if((0.50f <= maxAmplitude) && (maxAmplitude < 1.10f))
    {
        return(0x01UL);
    }
    else if(1.10f <= maxAmplitude)
    {
        return(0x00UL);
    }
    else
    {
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoWDtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for WDTRIM bits in register CLK_ECO_CONFIG2.
*   max amplitude (Vp) |   WDTRIM value
* Below configuration is for CAT1C devices
*      0.5[V] <= Vp <  0.6[V]    |      0x02
*      0.6[V] <= Vp <  0.7[V]    |      0x03
*      0.7[V] <= Vp <  0.8[V]    |      0x04
*      0.8[V] <= Vp <  0.9[V]    |      0x05
*      0.9[V] <= Vp <  1.0[V]    |      0x06
*      1.0[V] <= Vp <  1.1[V]    |      0x07
*      1.1[V] <= Vp              |      0x07
* Below configuration is for CAT1B(B2) devices
*      50[mV] = Vp               |      0x0
*      75[mV] = Vp               |      0x1
*      100[mV] = Vp              |      0x2
*      125[mV] = Vp              |      0x3
*      150[mV] = Vp              |      0x4
*      175[mV] = Vp              |      0x5
*      200[mV] = Vp              |      0x6
*      225[mV] = Vp              |      0x7
*   \param amplitude: Max amplitude (Vp) calculated by below formula.
*         Vp = 1,000 * sqrt(drivelevel / 2 / esr) / 3.14 / freqMHz / cLoad
*
*   \return : value to be set to WDTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoWDtrim(float32_t amplitude)
{
    if(amplitude < 0.50f)
    {
        return (CY_SYSCLK_INVALID_TRIM_VALUE);
    }

    if( (0.50f <= amplitude) && (amplitude < 0.60f))
    {
        return(0x02UL);
    }
    else if(amplitude < 0.7f)
    {
        return(0x03UL);
    }
    else if(amplitude < 0.8f)
    {
        return(0x04UL);
    }
    else if(amplitude < 0.9f)
    {
        return(0x05UL);
    }
    else if(amplitude < 1.0f)
    {
        return(0x06UL);
    }
    else if(amplitude < 1.1f)
    {
        return(0x07UL);
    }
    else if(1.1f <= amplitude)
    {
        return(0x07UL);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoGtrim
****************************************************************************//**
*
*   The range of gm value will be defined by GTRIM value as shown in below table.
*   We set the GTRIM value so that it is guaranteed for gm value to be more than gm_min
*
*    GTRIM value |  gm
*       0x00     |  0.0[mA/V] <= gm < 2.2[mA/V]
*       0x01     |  2.2[mA/V] <= gm < 4.4[mA/V]
*       0x02     |  4.4[mA/V] <= gm < 6.6[mA/V]
*       0x03     |  6.6[mA/V] <= gm < 8.8[mA/V]
*       0x04     |  8.8[mA/V] <= gm <11.0[mA/V]
*       0x05     | 11.0[mA/V] <= gm <13.2[mA/V]
*       0x06     | 13.2[mA/V] <= gm <15.4[mA/V]
*       0x07     | 15.4[mA/V] <= gm <17.6[mA/V]
*
*   \param gm_min: Minimum of gm (gm_min) calculated by below formula.
*   gm_min mA/V = 5 * 4 * 3.14 * 3.14 * freqMhz^2 * cLoad^2 * 4 * esr / 1,000,000,000
*
*   \return : value to be set to GTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoGtrim(float32_t gm_min)
{
    if( (0.0f <= gm_min) && (gm_min < 2.2f))
    {
        return(0x00UL+1UL);
    }
    else if(gm_min < 4.4f)
    {
        return(0x01UL+1UL);
    }
    else if(gm_min < 6.6f)
    {
        return(0x02UL+1UL);
    }
    else if(gm_min < 8.8f)
    {
        return(0x03UL+1UL);
    }
    else if(gm_min < 11.0f)
    {
        return(0x04UL+1UL);
    }
    else if(gm_min < 13.2f)
    {
        return(0x05UL+1UL);
    }
    else if(gm_min < 15.4f)
    {
        return(0x06UL+1UL);
    }
    else if(gm_min < 17.6f)
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoRtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for RTRIM bits in register CLK_ECO_CONFIG2.
*         Eco freq  (F)            |   RTRIM value
*                  F > 28.60[MHz]  |      0x00
*    28.60[MHz] >= F > 23.33[MHz]  |      0x01
*    23.33[MHz] >= F > 16.50[MHz]  |      0x02
*    16.50[MHz] >= F               |      0x03
*
*   \param freqMHz: Operating frequency of the crystal in MHz.
*
*   \return : value to be set to RTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoRtrim(float32_t freqMHz)
{
    if(freqMHz > 28.6f)
    {
        return(0x00UL);
    }
    else if(freqMHz > 23.33f)
    {
        return(0x01UL);
    }
    else if(freqMHz > 16.5f)
    {
        return(0x02UL);
    }
    else if(freqMHz > 0.0f)
    {
        return(0x03UL);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

