zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoFtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for FTRIM bits in register CLK_ECO_CONFIG2.
*
*   \return : value to be set to FTRIM.
*
*   \note: This function does not check the invalid input value.
*          It should be cared by caller program.
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoFtrim(void)
{
    return(0x03UL);
}

cy_en_sysclk_status_t Cy_SysClk_EcoConfigure(uint32_t freq, uint32_t cSum, uint32_t esr, uint32_t driveLevel)
{
    uint32_t minRneg = (5UL * esr);

    /* Invalid state error if ECO is already enabled */
    if (0UL != (SRSS_CLK_ECO_CONFIG_ECO_EN_Msk & SRSS_CLK_ECO_CONFIG))
    {
        return(CY_SYSCLK_INVALID_STATE);
    }

    /* calculate intermediate values */
    float32_t freqMHz = (float32_t)freq / 1000000.0f;

    uint32_t maxAmpl = CY_SYSLIB_DIV_ROUND((159155UL * /* 5 * 100000 / PI */
           cy_sqrt(CY_SYSLIB_DIV_ROUND(2000000UL * driveLevel, esr))), /* Scaled by 2 */
                                       (CY_SYSLIB_DIV_ROUND(freq, 1000UL)/* KHz */ * cSum)); /* The result is scaled by 10^3 */

    float32_t maxAmplitude = (float32_t)maxAmpl/1000.0f;

    float32_t gm_min = (157.91367042f /*4 * M_PI * M_PI * 4*/ * (float32_t)minRneg * freqMHz * freqMHz * (float32_t)cSum * (float32_t)cSum) /
                             1000000000.0f;

    /* Get trim values according to calculated values */
    uint32_t atrim, agcen, wdtrim, gtrim, rtrim, ftrim;

    atrim  = Cy_SysClk_SelectEcoAtrim(maxAmplitude);
    if(atrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    agcen = Cy_SysClk_SelectEcoAGCEN(maxAmplitude);
    if(agcen == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    wdtrim = Cy_SysClk_SelectEcoWDtrim(maxAmplitude);
    if(wdtrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    gtrim  = Cy_SysClk_SelectEcoGtrim(gm_min);
    if(gtrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    rtrim  = Cy_SysClk_SelectEcoRtrim(freqMHz);
    if(rtrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    ftrim  = Cy_SysClk_SelectEcoFtrim();

    /* Update all fields of trim control register with one write, without changing the ITRIM field */
    SRSS_CLK_ECO_CONFIG2 =
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_WDTRIM, wdtrim)  |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_ATRIM, atrim) |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_FTRIM, ftrim)    |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_RTRIM, rtrim)    |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_GTRIM, gtrim);

    SRSS_CLK_ECO_CONFIG = _VAL2FLD(SRSS_CLK_ECO_CONFIG_AGC_EN, agcen);

    ecoFrequency = freq;

    return(CY_SYSCLK_SUCCESS);
}

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) */

#if defined (CY_IP_MXS22SRSS)

cy_en_sysclk_status_t Cy_SysClk_EcoManualConfigure(const cy_stc_clk_eco_config_t *ecoConfig)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    CY_ASSERT_L3(CY_SYSCLK_IS_CLK_ECO_CTRIM_VALID(ecoConfig->ecoCtrim));
    CY_ASSERT_L3(CY_SYSCLK_IS_CLK_ECO_GTRIM_VALID(ecoConfig->ecoGtrim));

    /* Invalid state error if ECO is already enabled */
    if (0UL != (SRSS_CLK_ECO_CONFIG_ECO_EN_Msk & SRSS_CLK_ECO_CONFIG))
    {
        retVal = CY_SYSCLK_INVALID_STATE;
    }

    if( CY_SYSCLK_SUCCESS == retVal)
    {
        SRSS_CLK_ECO_CONFIG2 =
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_ECO_TRIM_CL, ecoConfig->ecoCtrim) |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_ECO_TRIM_GAIN, ecoConfig->ecoGtrim);

        SRSS_CLK_TRIM_ECO_CTL |=
        _VAL2FLD(SRSS_CLK_TRIM_ECO_CTL_ECO_CTRL_IBOOSTEN, ecoConfig->ecoIboost);

        ecoFrequency = ecoConfig->ecoClkfreq;
    }

    return retVal;

}


#endif /* defined (CY_IP_MXS22SRSS) */


void Cy_SysClk_EcoDisable(void)
{
#if (CY_SRSS_ECO_PRESENT)
    SRSS_CLK_ECO_CONFIG &= ~SRSS_CLK_ECO_CONFIG_ECO_EN_Msk;
#endif
}


uint32_t Cy_SysClk_EcoGetStatus(void)
{
#if (CY_SRSS_ECO_PRESENT)
    uint32_t eco_status        = SRSS_CLK_ECO_STATUS;
    uint32_t eco_status_mask   = SRSS_CLK_ECO_STATUS_Msk;

    /* if ECO is not ready, just report the ECO_OK bit. Otherwise report 2 = ECO ready */
    return ((eco_status_mask == (eco_status_mask & eco_status)) ?
        CY_SYSCLK_ECOSTAT_STABLE : (SRSS_CLK_ECO_STATUS_Msk & eco_status));
#else
    return 0;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_EcoEnable(uint32_t timeoutus)
{
#if (CY_SRSS_ECO_PRESENT)
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;
    bool zeroTimeout = (0UL == timeoutus);

    /* Invalid state error if ECO is already enabled */
    if (0UL == (SRSS_CLK_ECO_CONFIG_ECO_EN_Msk & SRSS_CLK_ECO_CONFIG))
    {
        /* Set ECO enable */
        SRSS_CLK_ECO_CONFIG |= SRSS_CLK_ECO_CONFIG_ECO_EN_Msk;

        /* Wait for CY_SYSCLK_ECOSTAT_STABLE */
        for (; (CY_SYSCLK_ECOSTAT_STABLE != Cy_SysClk_EcoGetStatus()) && (0UL != timeoutus); timeoutus--)
        {
            Cy_SysLib_DelayUs(1U);
        }

        if (zeroTimeout || (0UL != timeoutus))
        {
            retVal = CY_SYSCLK_SUCCESS;
        }
        else
        {
            /* If ECO doesn't start, then disable it */
            SRSS_CLK_ECO_CONFIG &= ~SRSS_CLK_ECO_CONFIG_ECO_EN_Msk;
            retVal = CY_SYSCLK_TIMEOUT;
        }
    }

    return (retVal);

#else
    (void) timeoutus;
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}

uint32_t Cy_SysClk_EcoGetFrequency(void)
{
#if (CY_SRSS_ECO_PRESENT)
    return ((CY_SYSCLK_ECOSTAT_STABLE == Cy_SysClk_EcoGetStatus()) ? ecoFrequency : 0UL);
#else
    return 0;
#endif
}

void Cy_SysClk_EcoSetFrequency(uint32_t freq)
{
#if (CY_SRSS_ECO_PRESENT)
    ecoFrequency = freq;
#else
    ecoFrequency = 0;
#endif
}

cy_en_sysclk_status_t Cy_SysClk_EcoPrescaleConfigure(uint32_t enable, uint32_t int_div, uint32_t frac_div)
{
    uint32_t timeoutus = CY_SYSCLK_ECO_PRESCALER_TIMEOUT_US;
    (void) enable;
#if (CY_SRSS_ECO_PRESENT)
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;

    if(0UL != enable) {
        /* Invalid state error if CO_DIV_ENABLED is already enabled */
        if (0UL == (SRSS_CLK_ECO_PRESCALE_ECO_DIV_ENABLED_Msk & SRSS_CLK_ECO_PRESCALE))
        {
            SRSS_CLK_ECO_PRESCALE = (_VAL2FLD(SRSS_CLK_ECO_PRESCALE_ECO_INT_DIV, int_div) | \
                                      _VAL2FLD(SRSS_CLK_ECO_PRESCALE_ECO_FRAC_DIV, frac_div));

