zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
bool Cy_SysClk_LpEcoPrescaleIsEnabled(void)
{
    return (_FLD2BOOL(BACKUP_LPECO_PRESCALE_LPECO_DIV_ENABLED, BACKUP_LPECO_PRESCALE));
}

bool Cy_SysClk_LpEcoAmplitudeOkay(void)
{
    return (_FLD2BOOL(BACKUP_LPECO_STATUS_LPECO_AMPDET_OK, BACKUP_LPECO_STATUS));
}

bool Cy_SysClk_LpEcoIsReady(void)
{
    return (_FLD2BOOL(BACKUP_LPECO_STATUS_LPECO_READY, BACKUP_LPECO_STATUS));
}

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) && (defined (SRSS_BACKUP_S40E_LPECO_PRESENT) && (SRSS_BACKUP_S40E_LPECO_PRESENT == 1u)) */

/* ========================================================================== */
/* ===========================    IHO SECTION    ============================ */
/* ========================================================================== */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
bool Cy_SysClk_IhoIsEnabled(void)
{
#if (CY_SRSS_IHO_PRESENT)
  #if !defined(CY_IP_MXS22SRSS_VERSION_MINOR) || CY_IP_MXS22SRSS_VERSION_MINOR == (0u)
    return (_FLD2BOOL(SRSS_CLK_IHO_CONFIG_ENABLE, SRSS_CLK_IHO_CONFIG));
  #else
    return true;
  #endif
#else
    return false;
#endif
}

void Cy_SysClk_IhoDisable(void)
{
#if (CY_SRSS_IHO_PRESENT) && (!defined(CY_IP_MXS22SRSS_VERSION_MINOR) || CY_IP_MXS22SRSS_VERSION_MINOR == (0u))
    SRSS_CLK_IHO_CONFIG &= ~SRSS_CLK_IHO_CONFIG_ENABLE_Msk;
#endif
}

void Cy_SysClk_IhoEnable(void)
{
#if (CY_SRSS_IHO_PRESENT) && (!defined(CY_IP_MXS22SRSS_VERSION_MINOR) || CY_IP_MXS22SRSS_VERSION_MINOR == (0u))
    SRSS_CLK_IHO_CONFIG |= SRSS_CLK_IHO_CONFIG_ENABLE_Msk;
#endif
}

#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) */

#if defined (CY_IP_MXS22SRSS)
void Cy_SysClk_IhoDeepsleepEnable(void)
{
#if (CY_SRSS_IHO_PRESENT)
    SRSS_CLK_IHO_CONFIG |= SRSS_CLK_IHO_CONFIG_DPSLP_ENABLE_Msk;
#endif
}

bool Cy_SysClk_IhoIsDeepsleepEnabled(void)
{
#if (CY_SRSS_IHO_PRESENT)
    return (_FLD2BOOL(SRSS_CLK_IHO_CONFIG_DPSLP_ENABLE, SRSS_CLK_IHO_CONFIG));
#else
    return false;
#endif
}

void Cy_SysClk_IhoDeepsleepDisable(void)
{
#if (CY_SRSS_IHO_PRESENT)
    SRSS_CLK_IHO_CONFIG &= ~SRSS_CLK_IHO_CONFIG_DPSLP_ENABLE_Msk;
#endif
}

void Cy_SysClk_IhoSetTrim(uint32_t trimVal)
{
#if (CY_SRSS_IHO_PRESENT)
    CY_REG32_CLR_SET(SRSS_CLK_IHO_CONFIG, SRSS_CLK_IHO_CONFIG_IHO_TRIM_FREQ, trimVal);
#endif
}

uint32_t Cy_SysClk_IhoGetTrim(void)
{
#if (CY_SRSS_IHO_PRESENT)
    return (_FLD2VAL(SRSS_CLK_IHO_CONFIG_IHO_TRIM_FREQ, SRSS_CLK_IHO_CONFIG));
#else
    return 0U;
#endif
}


#endif /* defined (CY_IP_MXS22SRSS) */


/* ========================================================================== */
/* ===========================    IMO SECTION    ============================ */
/* ========================================================================== */
#if defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))

void Cy_SysClk_ImoEnable(void)
{
#if defined (CY_SRSS_IMO_PRESENT) && (CY_SRSS_IMO_PRESENT == 1)
    SRSS_CLK_IMO_CONFIG |= SRSS_CLK_IMO_CONFIG_ENABLE_Msk;
#endif
}

void Cy_SysClk_ImoDisable(void)
{
#if defined (CY_SRSS_IMO_PRESENT) && (CY_SRSS_IMO_PRESENT == 1)
    SRSS_CLK_IMO_CONFIG &= ~SRSS_CLK_IMO_CONFIG_ENABLE_Msk;
#endif
}

bool Cy_SysClk_ImoIsEnabled(void)
{
#if defined (CY_SRSS_IMO_PRESENT) && (CY_SRSS_IMO_PRESENT == 1)
    return (_FLD2BOOL(SRSS_CLK_IMO_CONFIG_ENABLE, SRSS_CLK_IMO_CONFIG));
#else
    return false;
#endif
}
#endif /* defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) */

#if defined (CY_IP_MXS40SSRSS)

void Cy_SysClk_ImoDeepsleepEnable(void)
{
#if (CY_SRSS_IMO_PRESENT)
    SRSS_CLK_IMO_CONFIG |= SRSS_CLK_IMO_CONFIG_DPSLP_ENABLE_Msk;
#endif
}

bool Cy_SysClk_ImoIsDeepsleepEnabled(void)
{
#if (CY_SRSS_IMO_PRESENT)
    return (_FLD2BOOL(SRSS_CLK_IMO_CONFIG_DPSLP_ENABLE, SRSS_CLK_IMO_CONFIG));
#else
    return false;
#endif
}

void Cy_SysClk_ImoDeepsleepDisable(void)
{
#if (CY_SRSS_IMO_PRESENT)
    SRSS_CLK_IMO_CONFIG &= ~SRSS_CLK_IMO_CONFIG_DPSLP_ENABLE_Msk;
#endif
}
#endif /* defined (CY_IP_MXS40SSRSS) */

/* ========================================================================== */
/* ====================    INPUT MULTIPLEXER SECTION    ===================== */
/* ========================================================================== */


uint32_t Cy_SysClk_ClkPathMuxGetFrequency(uint32_t clkPath)
{
    CY_ASSERT_L1(clkPath < CY_SRSS_NUM_CLKPATH);

    uint32_t freq = 0UL;    /* The path mux output frequency in Hz, 0 = an unknown frequency */

    /* Get the frequency of the source, i.e., the path mux input */
    switch(Cy_SysClk_ClkPathGetSource(clkPath))
    {
        case CY_SYSCLK_CLKPATH_IN_IMO: /* The IMO frequency is fixed at 8 MHz */
            freq = CY_SYSCLK_IMO_FREQ;
            break;

        case CY_SYSCLK_CLKPATH_IN_EXT:
            freq = Cy_SysClk_ExtClkGetFrequency();
            break;

        case CY_SYSCLK_CLKPATH_IN_ECO:
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_IP_MXS22SRSS) || \
            (defined (CY_IP_MXS40SSRSS) && (SRSS_ECO_PRESENT == 1UL))
            freq = Cy_SysClk_EcoGetFrequency();
#endif
            break;

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) && (defined (SRSS_BACKUP_S40E_LPECO_PRESENT) && (SRSS_BACKUP_S40E_LPECO_PRESENT == 1u))
        case CY_SYSCLK_CLKPATH_IN_LPECO:
            freq = Cy_SysClk_LpEcoGetFrequency();
            break;
#endif

#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS)
        case CY_SYSCLK_CLKPATH_IN_ALTHF:
            freq = Cy_SysClk_AltHfGetFrequency();
            break;
#endif
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
        case CY_SYSCLK_CLKPATH_IN_PILO:
            freq = (0UL != (SRSS_CLK_PILO_CONFIG & SRSS_CLK_PILO_CONFIG_PILO_EN_Msk)) ? CY_SYSCLK_PILO_FREQ : 0UL;
            break;
#endif

#if defined (CY_IP_MXS40SSRSS)
        case CY_SYSCLK_CLKPATH_IN_ALTLF:
            freq = Cy_SysClk_AltLfGetFrequency();
            break;
#endif

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
        case CY_SYSCLK_CLKPATH_IN_IHO:
            freq = (Cy_SysClk_IhoIsEnabled()) ? CY_SYSCLK_IHO_FREQ : 0UL;
            break;
#endif

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
        case CY_SYSCLK_CLKPATH_IN_ILO0:
#else
        case CY_SYSCLK_CLKPATH_IN_ILO:
#endif
            freq = (0UL != (SRSS_CLK_ILO_CONFIG & SRSS_CLK_ILO_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;

        case CY_SYSCLK_CLKPATH_IN_WCO:
            freq = (Cy_SysClk_WcoOkay()) ? CY_SYSCLK_WCO_FREQ : 0UL;
            break;

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
        case CY_SYSCLK_CLKPATH_IN_ILO1:
            freq = (0UL != (SRSS_CLK_ILO_CONFIG & SRSS_CLK_ILO_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;
#endif

        default:
            /* Don't know the frequency of dsi_out, leave freq = 0UL */
            break;
    }

    return (freq);
}

