zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
/* PLL200M */
/* PLL OUTPUT_DIV bitfield allowable range */
#define CY_SYSCLK_PLL_MIN_OUTPUT_DIV   (2UL)
#define CY_SYSCLK_PLL_MAX_OUTPUT_DIV   (16UL)

/* PLL REFERENCE_DIV bitfield allowable range */
#define CY_SYSCLK_PLL_MIN_REF_DIV      (1UL)
#define CY_SYSCLK_PLL_MAX_REF_DIV      (18UL)

/* PLL FEEDBACK_DIV bitfield allowable ranges, LF and normal modes */
#define CY_SYSCLK_PLL_MIN_FB_DIV_LF    (19UL)
#define CY_SYSCLK_PLL_MAX_FB_DIV_LF    (56UL)
#define CY_SYSCLK_PLL_MIN_FB_DIV_NORM  (22UL)
#define CY_SYSCLK_PLL_MAX_FB_DIV_NORM  (112UL)

/* PLL FEEDBACK_DIV bitfield allowable range selection */
#define CY_SYSCLK_PLL_MIN_FB_DIV       ((config->lfMode) ? CY_SYSCLK_PLL_MIN_FB_DIV_LF : CY_SYSCLK_PLL_MIN_FB_DIV_NORM)
#define CY_SYSCLK_PLL_MAX_FB_DIV       ((config->lfMode) ? CY_SYSCLK_PLL_MAX_FB_DIV_LF : CY_SYSCLK_PLL_MAX_FB_DIV_NORM)

/* PLL Fvco range allowable ranges, LF and normal modes */
#define CY_SYSCLK_PLL_MIN_FVCO_LF      (170000000UL)
#define CY_SYSCLK_PLL_MAX_FVCO_LF      (200000000UL)
#define CY_SYSCLK_PLL_MIN_FVCO_NORM    (200000000UL)
#define CY_SYSCLK_PLL_MAX_FVCO_NORM    (400000000UL)
/* PLL Fvco range selection */
#define CY_SYSCLK_PLL_MIN_FVCO         ((config->lfMode) ? CY_SYSCLK_PLL_MIN_FVCO_LF : CY_SYSCLK_PLL_MIN_FVCO_NORM)
#define CY_SYSCLK_PLL_MAX_FVCO         ((config->lfMode) ? CY_SYSCLK_PLL_MAX_FVCO_LF : CY_SYSCLK_PLL_MAX_FVCO_NORM)

/* PLL input and output frequency limits */
#define CY_SYSCLK_PLL_MIN_IN_FREQ  (4000000UL)
#define CY_SYSCLK_PLL_MAX_IN_FREQ  (64000000UL)
#define CY_SYSCLK_PLL_MIN_OUT_FREQ (CY_SYSCLK_PLL_MIN_FVCO / CY_SYSCLK_PLL_MAX_OUTPUT_DIV)
#if defined (CY_DEVICE_SERIES_CYT2B6)
#define CY_SYSCLK_PLL_MAX_OUT_FREQ (80000000UL)
#elif defined (CY_DEVICE_TVIIBE)
#define CY_SYSCLK_PLL_MAX_OUT_FREQ (160000000UL)
#else
#define CY_SYSCLK_PLL_MAX_OUT_FREQ (200000000UL)
#endif

/* PLL400M */

/* Only include PLL400M macros for devices that contain PLL400M IP. */
#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u)
/* PLL OUTPUT_DIV bitfield allowable range */
#define CY_SYSCLK_PLL400M_MIN_OUTPUT_DIV   (2UL)
#define CY_SYSCLK_PLL400M_MAX_OUTPUT_DIV   (16UL)

/* PLL REFERENCE_DIV bitfield allowable range */
#define CY_SYSCLK_PLL400M_MIN_REF_DIV      (1UL)
#define CY_SYSCLK_PLL400M_MAX_REF_DIV      (16UL)

/* PLL FEEDBACK_DIV bitfield allowable range selection */
#define CY_SYSCLK_PLL400M_MIN_FB_DIV       (16UL)
#define CY_SYSCLK_PLL400M_MAX_FB_DIV       (200UL)

/* PLL Fvco range selection */
#define CY_SYSCLK_PLL400M_MIN_FVCO         (400000000UL)
#define CY_SYSCLK_PLL400M_MAX_FVCO         (800000000UL)

/* PLL input and output frequency limits */
#define CY_SYSCLK_PLL400M_MIN_IN_FREQ  (4000000UL)
#define CY_SYSCLK_PLL400M_MAX_IN_FREQ  (64000000UL)
#define CY_SYSCLK_PLL400M_MIN_OUT_FREQ (25000000UL)
#define CY_SYSCLK_PLL400M_MAX_OUT_FREQ (400000000UL)
#endif



/* DPLL-LP */

/* DPLL-LP OUTPUT_DIV bitfield allowable range */
#define CY_SYSCLK_DPLL_LP_MIN_OUTPUT_DIV   (1UL)
#define CY_SYSCLK_DPLL_LP_MAX_OUTPUT_DIV   (16UL)

/* DPLL-LP REFERENCE_DIV bitfield allowable range */
#define CY_SYSCLK_DPLL_LP_MIN_REF_DIV      (1UL)
#define CY_SYSCLK_DPLL_LP_MAX_REF_DIV      (16UL)

/* DPLL-LP FEEDBACK_DIV bitfield allowable range selection */
#define CY_SYSCLK_DPLL_LP_MIN_FB_DIV       (16UL)
#define CY_SYSCLK_DPLL_LP_MAX_FB_DIV       (200UL)

/* DPLL-LP Fdco range selection */
#define CY_SYSCLK_DPLL_LP_MIN_FDCO         (160000000UL)
#define CY_SYSCLK_DPLL_LP_MAX_FDCO         (480000000UL)
#define CY_SYSCLK_DPLL_LP_DCO_MODE_LIMIT   (310000000UL)

/* DPLL-LP pdf range selection */
#define CY_SYSCLK_DPLL_LP_MIN_PDF         (4000000UL)
#define CY_SYSCLK_DPLL_LP_MAX_PDF         (8000000UL)

/* DPLL-LP input and output frequency limits */
#define CY_SYSCLK_DPLL_LP_MIN_IN_FREQ  (4000000UL)
#define CY_SYSCLK_DPLL_LP_MAX_IN_FREQ  (64000000UL)
#define CY_SYSCLK_DPLL_LP_MIN_OUT_FREQ (10000000UL)
#define CY_SYSCLK_DPLL_LP_MAX_OUT_FREQ (400000000UL)

/* DPLL-LP default config values */
#if defined (CY_IP_MXS22SRSS) && CY_IP_MXS22SRSS_VERSION_MINOR == (0u)
#define CY_SYSCLK_DPLL_LP_CONFIG4_DCO_CODE  (0xFUL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KI_INT    (0xAUL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KI_FRACT  (0xBUL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KI_SSCG   (0x7UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KP_INT    (0x8UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KP_FRACT  (0x9UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KP_SSCG   (0x7UL)
#elif defined (CY_IP_MXS22SRSS) && CY_IP_MXS22SRSS_VERSION_MINOR == (1u)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_DEPTH         (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_RATE          (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_DITHER_EN     (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_MODE          (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_EN            (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG4_DCO_CODE           (0x0FUL)
#define CY_SYSCLK_DPLL_LP_CONFIG4_PLL_TG             (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KI_INT             (0x28UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KP_INT             (0x20UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KI_ACC_INT         (0x27UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KP_ACC_INT         (0x23UL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KI_FRAC            (0x2CUL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KP_FRAC            (0x24UL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KI_ACC_FRAC        (0x27UL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KP_ACC_FRAC        (0x1CUL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KI_SSCG            (0x1CUL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KP_SSCG            (0x1CUL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KI_ACC_SSCG        (0x27UL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KP_ACC_SSCG        (0x23UL)
#else
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_DEPTH         (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_RATE          (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_DITHER_EN     (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_MODE          (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG3_SSCG_EN            (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG4_DCO_CODE           (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG4_ACC_MODE           (0x01UL)
#define CY_SYSCLK_DPLL_LP_CONFIG4_TDC_MODE           (0x01UL)
#define CY_SYSCLK_DPLL_LP_CONFIG4_PLL_TG             (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG4_ACC_CNT_LOCK       (0x00UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KI_INT             (0x24UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KP_INT             (0x1CUL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KI_ACC_INT         (0x23UL)
#define CY_SYSCLK_DPLL_LP_CONFIG5_KP_ACC_INT         (0x1AUL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KI_FRAC            (0x24UL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KP_FRAC            (0x20UL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KI_ACC_FRAC        (0x23UL)
#define CY_SYSCLK_DPLL_LP_CONFIG6_KP_ACC_FRAC        (0x1AUL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KI_SSCG            (0x18UL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KP_SSCG            (0x18UL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KI_ACC_SSCG        (0x16UL)
#define CY_SYSCLK_DPLL_LP_CONFIG7_KP_ACC_SSCG        (0x14UL)
#endif
/* DPLL-HP */

/* DPLL-HP NDIV bitfield allowable range */
#define CY_SYSCLK_DPLL_HP_MIN_NDIV   (8UL)
#define CY_SYSCLK_DPLL_HP_MAX_NDIV   (250UL)

/* DPLL-HP PDIV bitfield allowable range */
#define CY_SYSCLK_DPLL_HP_MIN_PDIV   (1UL)
#define CY_SYSCLK_DPLL_HP_MAX_PDIV   (8UL)

/* DPLL-HP KDIV bitfield allowable range */
#define CY_SYSCLK_DPLL_HP_MIN_KDIV   (2UL)
#define CY_SYSCLK_DPLL_HP_MAX_KDIV   (8UL)
/* DPLL-HP Fdco range selection */
#define CY_SYSCLK_DPLL_HP_MIN_FDCO         (400000UL)
#define CY_SYSCLK_DPLL_HP_MAX_FDCO         (1000000UL)

