zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
    /* Initialize config structure to 0 */
    *config = (cy_stc_pll_manual_config_t){0};

    uint32_t tempReg = SRSS_CLK_PLL_CONFIG[pllNum];
    config->feedbackDiv  = (uint8_t)_FLD2VAL(SRSS_CLK_PLL_CONFIG_FEEDBACK_DIV,  tempReg);
    config->referenceDiv = (uint8_t)_FLD2VAL(SRSS_CLK_PLL_CONFIG_REFERENCE_DIV, tempReg);
    config->outputDiv    = (uint8_t)_FLD2VAL(SRSS_CLK_PLL_CONFIG_OUTPUT_DIV,    tempReg);
    config->lfMode       =         _FLD2BOOL(SRSS_CLK_PLL_CONFIG_PLL_LF_MODE,   tempReg);
    config->outputMode   = (cy_en_fll_pll_output_mode_t)((uint32_t)_FLD2VAL(SRSS_CLK_PLL_CONFIG_BYPASS_SEL, tempReg));
    retVal = CY_SYSCLK_SUCCESS;

    return (retVal);
}

cy_en_sysclk_status_t Cy_SysClk_Pll200MEnable(uint32_t pllNum, uint32_t timeoutus)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    bool zeroTimeout = (timeoutus == 0UL);

    CY_ASSERT_L1(pllNum < CY_SRSS_NUM_PLL200M);

    /* first set the PLL enable bit */
    SRSS_CLK_PLL_CONFIG[pllNum] |= SRSS_CLK_PLL_CONFIG_ENABLE_Msk;

    /* now do the timeout wait for PLL_STATUS, bit LOCKED */
    for (; (0UL == (SRSS_CLK_PLL_STATUS_LOCKED_Msk & SRSS_CLK_PLL_STATUS[pllNum])) &&
           (0UL != timeoutus);
         timeoutus--)
    {
        Cy_SysLib_DelayUs(1U);
    }

    if (zeroTimeout || (0UL != timeoutus))
    {
        /* Unbypass PLL, if it is not in AUTO mode */
        if ((uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_INPUT == (uint32_t)_FLD2VAL(SRSS_CLK_PLL_CONFIG_BYPASS_SEL, SRSS_CLK_PLL_CONFIG[pllNum]))
        {
            CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[pllNum], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
        }

        retVal = CY_SYSCLK_SUCCESS;
    }
    else
    {
        /* If lock doesn't occur, then bypass PLL */
        CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[pllNum], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
        /* Wait at least 6 PLL clock cycles */
        Cy_SysLib_DelayUs(1U);
        /* And now disable the PLL itself */
        SRSS_CLK_PLL_CONFIG[pllNum] &= ~SRSS_CLK_PLL_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_TIMEOUT;
    }

    return (retVal);
}


uint32_t Cy_SysClk_Pll200MGetFrequency(uint32_t pllNum)
{
    uint32_t fDiv;    /* PLL multiplier/feedback divider */
    uint32_t rDiv;    /* PLL reference divider */
    uint32_t oDiv;    /* PLL output divider */
    bool  enabled;    /* PLL enable status; n/a for direct */
    uint32_t freq=0UL;    /* PLL Frequency */


    CY_ASSERT_L1(pllNum < CY_SRSS_NUM_PLL200M);

    cy_stc_pll_manual_config_t pllcfg = {0U,0U,0U,false,CY_SYSCLK_FLLPLL_OUTPUT_AUTO, 0, false, false, 0 , 0 , false};
    (void)Cy_SysClk_Pll200MGetConfiguration(pllNum, &pllcfg);
    enabled = (Cy_SysClk_Pll200MIsEnabled(pllNum)) && (CY_SYSCLK_FLLPLL_OUTPUT_INPUT != pllcfg.outputMode);
    fDiv = pllcfg.feedbackDiv;
    rDiv = pllcfg.referenceDiv;
    oDiv = pllcfg.outputDiv;

    if (enabled && /* If PLL is enabled and not bypassed */
    (0UL != rDiv) && (0UL != oDiv)) /* to avoid division by zero */
    {
        freq = Cy_SysClk_ClkPathMuxGetFrequency((pllNum + 1UL) + CY_SRSS_NUM_PLL400M);

        freq = (uint32_t)CY_SYSLIB_DIV_ROUND(((uint64_t)freq * (uint64_t)fDiv),
                                             ((uint64_t)rDiv * (uint64_t)oDiv));
    }

    return (freq);
}

#endif

#if defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
/* DPLL-LP */
bool Cy_SysClk_DpllLpIsEnabled(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_LP_PRESENT != 0U )
    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);
    return (_FLD2BOOL(CLK_DPLL_LP_CONFIG_ENABLE, SRSS_CLK_DPLL_LP_CONFIG(pllNum)));
#else
    return false;
#endif
}


bool Cy_SysClk_DpllLpLocked(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_LP_PRESENT != 0U )
    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);
    return (_FLD2BOOL(CLK_DPLL_LP_STATUS_LOCKED, SRSS_CLK_DPLL_LP_STATUS(pllNum)));
#else
     return false;
#endif
}


bool Cy_SysClk_DpllLpLostLock(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_LP_PRESENT != 0U )
    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

    bool retVal = _FLD2BOOL(CLK_DPLL_LP_STATUS_UNLOCK_OCCURRED, SRSS_CLK_DPLL_LP_STATUS(pllNum));
    /* write a 1 to clear the unlock occurred bit */
    SRSS_CLK_DPLL_LP_STATUS(pllNum) = CLK_DPLL_LP_STATUS_UNLOCK_OCCURRED_Msk;
    return (retVal);
#else
    return false;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_DpllLpDisable(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_LP_PRESENT != 0U )

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

    /* First bypass PLL */
    CY_REG32_CLR_SET(SRSS_CLK_DPLL_LP_CONFIG(pllNum), CLK_DPLL_LP_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
    /* Wait at least 6 PLL clock cycles */
    Cy_SysLib_DelayUs(1U);
    /* And now disable the PLL itself */
    SRSS_CLK_DPLL_LP_CONFIG(pllNum) &= ~CLK_DPLL_LP_CONFIG_ENABLE_Msk;
    retVal = CY_SYSCLK_SUCCESS;

    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_DpllLpConfigure(uint32_t pllNum, const cy_stc_pll_config_t *config)
{
    CY_UNUSED_PARAMETER(pllNum);
    CY_UNUSED_PARAMETER(config);

#if (CY_SRSS_DPLL_LP_PRESENT != 0U )

    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

    if (((config->inputFreq)  < CY_SYSCLK_DPLL_LP_MIN_IN_FREQ)  || (CY_SYSCLK_DPLL_LP_MAX_IN_FREQ  < (config->inputFreq)) ||
        ((config->outputFreq) < CY_SYSCLK_DPLL_LP_MIN_OUT_FREQ) || (CY_SYSCLK_DPLL_LP_MAX_OUT_FREQ < (config->outputFreq)))
    {
        retVal = CY_SYSCLK_BAD_PARAM;
    }
    else
    {
        cy_stc_dpll_lp_config_t    manualDpllLpConfig = (cy_stc_dpll_lp_config_t){0};
#if defined (CY_IP_MXS22SRSS)
        cy_stc_pll_manual_config_t manualConfig = {&manualDpllLpConfig, NULL};
#else
        cy_stc_pll_manual_config_t manualConfig = {&manualDpllLpConfig};
#endif
        /* If output mode is not bypass (input routed directly to output), then
           calculate new parameters. */
        if (config->outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT)
        {
            /* for each possible value of OUTPUT_DIV and REFERENCE_DIV (Q), try
               to find a value for FEEDBACK_DIV (P) that gives an output frequency
               as close as possible to the desired output frequency. */
            uint32_t p, q, out;
            uint32_t foutBest = 0UL; /* to ensure at least one pass through the for loops below */

        #if (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL))
            /* Modify automatic DPLL settings to generate 2x target clock internally and use 2x
               output divider to provide a 50/50 duty cycle clock. */
            uint32_t outputFrequency = config->outputFreq * 2UL;
        #else
            uint32_t outputFrequency = config->outputFreq;
        #endif /* (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) */

            /* REFERENCE_DIV (Q) selection */
            for (q = CY_SYSCLK_DPLL_LP_MIN_REF_DIV; q <= CY_SYSCLK_DPLL_LP_MAX_REF_DIV; q++)
            {
                /* FEEDBACK_DIV (P) selection */
                for (p = CY_SYSCLK_DPLL_LP_MIN_FB_DIV; p <= CY_SYSCLK_DPLL_LP_MAX_FB_DIV; p++)
                {
                    /* Calculate the intermediate FDCO,PDF and make sure that it's in range */
                    uint32_t pdf = (uint32_t)((uint64_t)(config->inputFreq) / (uint64_t)q);
                    uint32_t fdco = (uint32_t)((uint64_t)(pdf) * (uint64_t)p);

                    if (((CY_SYSCLK_DPLL_LP_MIN_FDCO <= fdco) && (fdco <= CY_SYSCLK_DPLL_LP_MAX_FDCO)) && ((CY_SYSCLK_DPLL_LP_MIN_PDF <= pdf) && (pdf <= CY_SYSCLK_DPLL_LP_MAX_PDF)))
                    {
                        /* OUTPUT_DIV selection */
                        for (out = CY_SYSCLK_DPLL_LP_MIN_OUTPUT_DIV; out <= CY_SYSCLK_DPLL_LP_MAX_OUTPUT_DIV; out++)
                        {
                            uint64_t tempVco = ((uint64_t)outputFrequency) * ((uint64_t)out);
                            uint64_t tempFeedBackDivLeftShifted = ((tempVco << (uint64_t)SRSS_DPLL_LP_FRAC_BIT_COUNT) * (uint64_t)q) / (uint64_t)config->inputFreq;
                            volatile uint32_t feedBackFracDiv  = (uint32_t)(tempFeedBackDivLeftShifted & ((1ULL << (uint64_t)SRSS_DPLL_LP_FRAC_BIT_COUNT) - 1ULL));
                            /* Calculate what output frequency will actually be produced.
                               If it's closer to the target than what we have so far, then save it. */
                            uint32_t fout = (uint32_t)((((uint64_t)config->inputFreq * (((uint64_t)p << SRSS_DPLL_LP_FRAC_BIT_COUNT) + (uint64_t)feedBackFracDiv)) / ((uint64_t)q * (uint64_t)out)) >> SRSS_DPLL_LP_FRAC_BIT_COUNT);

                            if ((uint32_t)abs((int32_t)fout - (int32_t)(outputFrequency)) <
                                (uint32_t)abs((int32_t)foutBest - (int32_t)(outputFrequency)))
                            {
                                if (foutBest == (outputFrequency))
                                {
                                   break;
                                }

                                foutBest = fout;
                                manualConfig.lpPllCfg->feedbackDiv  = (uint8_t)p;
                                manualConfig.lpPllCfg->referenceDiv = (uint8_t)q;

                            #if (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL))
                                /* Modify automatic DPLL settings to generate 2x target clock internally and use 2x
                                output divider to provide a 50/50 duty cycle clock. */
                                manualConfig.lpPllCfg->outputDiv    = (uint8_t)(out * 2UL);
                            #else
                                manualConfig.lpPllCfg->outputDiv    = (uint8_t)(out);
                            #endif /* (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) */
                                manualConfig.lpPllCfg->fracEn       = true;
                                manualConfig.lpPllCfg->fracDiv      = feedBackFracDiv;
                                manualConfig.lpPllCfg->pllDcoMode   = (fdco >= CY_SYSCLK_DPLL_LP_DCO_MODE_LIMIT) ? true : false;
                            }
                        }
                    }
                }
            }
            /* exit loops if foutBest equals outputFreq */

