zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

    /* Initialize config structure to 0 */
    *(config->lpPllCfg) = (cy_stc_dpll_lp_config_t){0};

    uint32_t tempReg = SRSS_CLK_DPLL_LP_CONFIG(pllNum);
    config->lpPllCfg->feedbackDiv  = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG_FEEDBACK_DIV,  tempReg);
    config->lpPllCfg->referenceDiv = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG_REFERENCE_DIV, tempReg);
    config->lpPllCfg->outputDiv    = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG_OUTPUT_DIV,    tempReg);
#if defined (CY_IP_MXS22SRSS)
    config->lpPllCfg->pllDcoMode   = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG_PLL_DCO_MODE,tempReg);
#else
    config->lpPllCfg->pllDcoMode   = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG_PLL_DCO_CODE_MULT,tempReg);
#endif
    config->lpPllCfg->outputMode   = (cy_en_fll_pll_output_mode_t)((uint32_t)_FLD2VAL(CLK_DPLL_LP_CONFIG_BYPASS_SEL, tempReg));

    tempReg = SRSS_CLK_DPLL_LP_CONFIG2(pllNum);
    config->lpPllCfg->fracDiv      = _FLD2VAL(CLK_DPLL_LP_CONFIG2_FRAC_DIV,  tempReg);
    config->lpPllCfg->fracDitherEn = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG2_FRAC_DITHER_EN, tempReg);
    config->lpPllCfg->fracEn       = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG2_FRAC_EN,    tempReg);

    tempReg = SRSS_CLK_DPLL_LP_CONFIG3(pllNum);
    config->lpPllCfg->sscgDepth  = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG3_SSCG_DEPTH,  tempReg);
    config->lpPllCfg->sscgRate   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG3_SSCG_RATE, tempReg);
    config->lpPllCfg->sscgDitherEn   = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG3_SSCG_DITHER_EN, tempReg);
    config->lpPllCfg->sscgMode   = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG3_SSCG_MODE, tempReg);
    config->lpPllCfg->sscgEn     = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG3_SSCG_EN,    tempReg);

#if (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))

    tempReg = SRSS_CLK_DPLL_LP_CONFIG4(pllNum);
    config->lpPllCfg->dcoCode  = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG4_DCO_CODE,  tempReg);
    config->lpPllCfg->accMode   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG4_ACC_MODE, tempReg);
    config->lpPllCfg->tdcMode   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG4_TDC_MODE, tempReg);
    config->lpPllCfg->pllTg   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG4_PLL_TG, tempReg);
    config->lpPllCfg->accCntLock     = (bool)_FLD2VAL(CLK_DPLL_LP_CONFIG4_ACC_CNT_LOCK, tempReg);

    tempReg = SRSS_CLK_DPLL_LP_CONFIG5(pllNum);
    config->lpPllCfg->kiInt  = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG5_KI_INT,  tempReg);
    config->lpPllCfg->kpInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG5_KP_INT, tempReg);
    config->lpPllCfg->kiAccInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG5_KI_ACC_INT, tempReg);
    config->lpPllCfg->kpAccInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG5_KP_ACC_INT, tempReg);

    tempReg = SRSS_CLK_DPLL_LP_CONFIG6(pllNum);
    config->lpPllCfg->kiInt  = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG6_KI_FRACT,  tempReg);
    config->lpPllCfg->kpInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG6_KP_FRACT, tempReg);
    config->lpPllCfg->kiAccInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG6_KI_ACC_FRACT, tempReg);
    config->lpPllCfg->kpAccInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG6_KP_ACC_FRACT, tempReg);

    tempReg = SRSS_CLK_DPLL_LP_CONFIG7(pllNum);
    config->lpPllCfg->kiInt  = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG7_KI_SSCG,  tempReg);
    config->lpPllCfg->kpInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG7_KP_SSCG, tempReg);
    config->lpPllCfg->kiAccInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG7_KI_ACC_SSCG, tempReg);
    config->lpPllCfg->kpAccInt   = (uint8_t)_FLD2VAL(CLK_DPLL_LP_CONFIG7_KP_ACC_SSCG, tempReg);
#endif
    retVal = CY_SYSCLK_SUCCESS;

    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}

cy_en_sysclk_status_t Cy_SysClk_DpllLpEnable(uint32_t pllNum, uint32_t timeoutus)
{
    CY_UNUSED_PARAMETER(pllNum);
    CY_UNUSED_PARAMETER(timeoutus);
#if (CY_SRSS_DPLL_LP_PRESENT != 0U )

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    bool zeroTimeout = (timeoutus == 0UL);

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

    /* first set the PLL enable bit */
    SRSS_CLK_DPLL_LP_CONFIG(pllNum) |= CLK_DPLL_LP_CONFIG_ENABLE_Msk;

    /* now do the timeout wait for PLL_STATUS, bit LOCKED */
    for (; (0UL == (CLK_DPLL_LP_STATUS_LOCKED_Msk & SRSS_CLK_DPLL_LP_STATUS(pllNum))) &&
           (0UL != timeoutus);
         timeoutus--)
    {
        Cy_SysLib_DelayUs(1U);
    }

    if (zeroTimeout || (0UL != timeoutus))
    {
        /* Unbypass PLL, if it is not in AUTO mode */
        if ((uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_INPUT == (uint32_t)_FLD2VAL(CLK_DPLL_LP_CONFIG_BYPASS_SEL, SRSS_CLK_DPLL_LP_CONFIG(pllNum)))
        {
            CY_REG32_CLR_SET(SRSS_CLK_DPLL_LP_CONFIG(pllNum), CLK_DPLL_LP_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
        }

        retVal = CY_SYSCLK_SUCCESS;
    }
    else
    {
        /* If lock doesn't occur, then bypass PLL */
        CY_REG32_CLR_SET(SRSS_CLK_DPLL_LP_CONFIG(pllNum), CLK_DPLL_LP_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
        /* Wait at least 6 PLL clock cycles */
        Cy_SysLib_DelayUs(1U);
        /* And now disable the PLL itself */
        SRSS_CLK_DPLL_LP_CONFIG(pllNum) &= ~CLK_DPLL_LP_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_TIMEOUT;
    }

    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}

uint32_t Cy_SysClk_DpllLpGetFrequency(uint32_t pllNum)
{
#if defined(__ARM_PCS_VFP) && defined(CY_SYSCLK_USE_FLOATING_MATH)
    float32_t fDiv;        /* PLL multiplier/feedback divider */
    float32_t rDiv;        /* PLL reference divider */
    float32_t oDiv;        /* PLL output divider */
    float32_t fracDiv;     /* PLL Fractional divider */
    bool      enabled;     /* PLL enable status; n/a for direct */
    float32_t freq = 0.0f; /* PLL Frequency */


    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

    cy_stc_dpll_lp_config_t    DpllLpConfig = (cy_stc_dpll_lp_config_t){0};
#if defined (CY_IP_MXS22SRSS)
    cy_stc_pll_manual_config_t pllcfg = {&DpllLpConfig, NULL};
#else
    cy_stc_pll_manual_config_t pllcfg = {&DpllLpConfig};
#endif
    (void)Cy_SysClk_DpllLpGetConfiguration(pllNum, &pllcfg);
    enabled = (Cy_SysClk_DpllLpIsEnabled(pllNum)) && (CY_SYSCLK_FLLPLL_OUTPUT_INPUT != pllcfg.lpPllCfg->outputMode);
    fDiv    = (float32_t)pllcfg.lpPllCfg->feedbackDiv;
    rDiv    = (float32_t)pllcfg.lpPllCfg->referenceDiv;
    oDiv    = (float32_t)pllcfg.lpPllCfg->outputDiv;
    fracDiv = (float32_t)pllcfg.lpPllCfg->fracDiv;

    if (enabled && /* If PLL is enabled and not bypassed */
        (0.0f != rDiv) && (0.0f != oDiv)) /* to avoid division by zero */
    {
#if defined (CY_IP_MXS40SSRSS)
        pllNum++; /* to correctly access PLL source clock */
#endif
        freq = (float32_t)Cy_SysClk_ClkPathMuxGetFrequency(pllNum);
        freq = freq * (fDiv + (fracDiv / (float32_t)(1 << SRSS_DPLL_LP_FRAC_BIT_COUNT))) / (rDiv * oDiv);
    }

    return ((uint32_t)freq);
#else
    uint32_t fDiv;    /* PLL multiplier/feedback divider */
    uint32_t rDiv;    /* PLL reference divider */
    uint32_t oDiv;    /* PLL output divider */
    uint32_t fracDiv; /* PLL Fractional divider */
    bool  enabled;    /* PLL enable status; n/a for direct */
    uint32_t freq=0UL;    /* PLL Frequency */


    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

