zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
                            if (((uint32_t)abs((int32_t)fout - (int32_t)(config->outputFreq)) <
                                (uint32_t)abs((int32_t)foutBest - (int32_t)(config->outputFreq))))
                            {
                                if (foutBest == (config->outputFreq))
                                {
                                   break;
                                }

                                foutBest = fout;
                                manualConfig.hpPllCfg->nDiv  = (uint8_t)(nDiv - 1U);
                                manualConfig.hpPllCfg->pDiv  = (uint8_t)(pDiv - 1U);
                                manualConfig.hpPllCfg->kDiv  = (uint8_t)(kDiv - 1U);
                                manualConfig.hpPllCfg->nDivFract  = feedBackFracDiv;
                            }
                        }
                    }
                }
            }
            /* exit loops if foutBest equals outputFreq */

        } /* if not, bypass output mode */

        /* If output mode is bypass (input routed directly to output), then
           use old parameters. */
        else
        {
            (void)Cy_SysClk_DpllHpGetConfiguration(pllNum, &manualConfig);
        }
        /* configure PLL based on calculated values */
        manualConfig.hpPllCfg->outputMode = config->outputMode;

        manualConfig.hpPllCfg->freqModeSel = Cy_SysClk_DpllHpGetFreqMode(config->inputFreq);
        manualConfig.hpPllCfg->flockThresh = (uint8_t)Cy_SysClk_DpllHpGetFlockTh(manualConfig.hpPllCfg->nDiv);
        manualConfig.hpPllCfg->betaExt     = (uint8_t)Cy_SysClk_DpllHpGetLfBeta(config->inputFreq, manualConfig.hpPllCfg->pDiv);

        /* Set the default parameters to remaining PLL configurations */
        manualConfig.hpPllCfg->ivrTrim     = (uint8_t)CY_SYSCLK_DPLL_HP_CONFIG2_IVR_TRIM;
        manualConfig.hpPllCfg->clkrSel     = CY_SYSCLK_DPLL_HP_CONFIG3_CLKR_SEL;
        manualConfig.hpPllCfg->alphaCoarse = (uint8_t)CY_SYSCLK_DPLL_HP_CONFIG4_LF_LC_ALPHA;
        manualConfig.hpPllCfg->betaCoarse  = (uint8_t)CY_SYSCLK_DPLL_HP_CONFIG4_LF_LC_BETA;
        manualConfig.hpPllCfg->flockWait   = (uint8_t)CY_SYSCLK_DPLL_HP_CONFIG4_FLOCK_WAITPER;
        manualConfig.hpPllCfg->flockLkThres= (uint8_t)CY_SYSCLK_DPLL_HP_CONFIG4_LK_TH;
        manualConfig.hpPllCfg->flockLkWait = (uint8_t)CY_SYSCLK_DPLL_HP_CONFIG4_LK_WAITPER;
        manualConfig.hpPllCfg->alphaExt    = (uint8_t)CY_SYSCLK_DPLL_HP_CONFIG5_LF_ALPHA;
        manualConfig.hpPllCfg->lfEn        = CY_SYSCLK_DPLL_HP_CONFIG5_LF_SET_PARAMS;
        manualConfig.hpPllCfg->dcEn        = CY_SYSCLK_DPLL_HP_DUTY_CAL_CTL_DC_EN;

        retVal = Cy_SysClk_DpllHpManualConfigure(pllNum, &manualConfig);

    } /* if no error */

    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_DpllHpManualConfigure(uint32_t pllNum, const cy_stc_pll_manual_config_t *config)
{
    CY_UNUSED_PARAMETER(pllNum);
    CY_UNUSED_PARAMETER(config);

#if (CY_SRSS_DPLL_HP_PRESENT)

    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_LP);

    if (Cy_SysClk_DpllHpIsEnabled(pllNum))
    {
        retVal = CY_SYSCLK_INVALID_STATE;
    }
    /* valid divider bitfield values */
    else if ((config->hpPllCfg->nDiv    < (CY_SYSCLK_DPLL_HP_MIN_NDIV - 1U)) || ((CY_SYSCLK_DPLL_HP_MAX_NDIV - 1U) < config->hpPllCfg->nDiv)    ||
             ((CY_SYSCLK_DPLL_HP_MAX_PDIV - 1U)    < config->hpPllCfg->pDiv) || ((CY_SYSCLK_DPLL_HP_MAX_KDIV - 1U)     < config->hpPllCfg->kDiv))
    {
         retVal = CY_SYSCLK_BAD_PARAM;
    }
    else /* no errors */
    {
        /* If output mode is bypass (input routed directly to output), then done.
           The output frequency equals the input frequency regardless of the frequency parameters. */
        if (config->hpPllCfg->outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT)
        {
                SRSS_CLK_DPLL_HP_CONFIG(pllNum) =
                _VAL2FLD(CLK_DPLL_HP_CONFIG_PLL_FREQ_NDIV_INT_SEL, config->hpPllCfg->nDiv)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG_PLL_FREQ_PDIV_SEL, config->hpPllCfg->pDiv) |
                _VAL2FLD(CLK_DPLL_HP_CONFIG_PLL_FREQ_KDIV_SEL, config->hpPllCfg->kDiv) |
                _VAL2FLD(CLK_DPLL_HP_CONFIG_ENABLE, config->hpPllCfg->pllEn);

                SRSS_CLK_DPLL_HP_CONFIG2(pllNum) =
                _VAL2FLD(CLK_DPLL_HP_CONFIG2_PLL_FREQ_NDIV_FRACT_SEL, config->hpPllCfg->nDivFract)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG2_PLL_FREQ_MODE_SEL, config->hpPllCfg->freqModeSel) |
                _VAL2FLD(CLK_DPLL_HP_CONFIG2_PLL_IVR_TRIM, config->hpPllCfg->ivrTrim);

                SRSS_CLK_DPLL_HP_CONFIG3(pllNum) =
                _VAL2FLD(CLK_DPLL_HP_CONFIG3_PLL_CLKR_SEL, config->hpPllCfg->clkrSel)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG3_PLL_FDSM_SEL, config->hpPllCfg->fdsmSel);

                SRSS_CLK_DPLL_HP_CONFIG4(pllNum) =
                _VAL2FLD(CLK_DPLL_HP_CONFIG4_PLL_LF_LC_ALPHA, config->hpPllCfg->alphaCoarse)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG4_PLL_LF_LC_BETA, config->hpPllCfg->betaCoarse)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG4_PLL_FLOCK_EN_THRESH, config->hpPllCfg->flockThresh)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG4_PLL_FLOCK_WAITPER, config->hpPllCfg->flockWait)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_THRESH, config->hpPllCfg->flockLkThres)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG4_PLL_FLOCK_LK_WAITPER, config->hpPllCfg->flockLkWait)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG4_PLL_FLOCK_OBSWIN, config->hpPllCfg->flockObs);

                SRSS_CLK_DPLL_HP_CONFIG5(pllNum) =
                _VAL2FLD(CLK_DPLL_HP_CONFIG5_PLL_LF_ALPHA, config->hpPllCfg->alphaExt)  |
                _VAL2FLD(CLK_DPLL_HP_CONFIG5_PLL_LF_BETA, config->hpPllCfg->betaExt) |
                _VAL2FLD(CLK_DPLL_HP_CONFIG5_PLL_LF_SET_PARAMS, config->hpPllCfg->lfEn);

                SRSS_CLK_DPLL_HP_TRIGMOD(pllNum) =
                _VAL2FLD(CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_FREQ, config->hpPllCfg->tmodFreq)  |
                _VAL2FLD(CLK_DPLL_HP_TRIGMOD_PLL_TRIMOD_GRD, config->hpPllCfg->tmodGrad);

                SRSS_CLK_DPLL_HP_TRIGMOD2(pllNum) =
                _VAL2FLD(CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_RATE, config->hpPllCfg->tmodRate)  |
                _VAL2FLD(CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_EN, config->hpPllCfg->tmodEn)  |
                _VAL2FLD(CLK_DPLL_HP_TRIGMOD2_PLL_TRIMOD_STP, config->hpPllCfg->tmodStop);

