zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
cy_en_sysclk_status_t Cy_SysClk_DpllHpEnable(uint32_t pllNum, uint32_t timeoutus)
{
    CY_UNUSED_PARAMETER(pllNum);
    CY_UNUSED_PARAMETER(timeoutus);

#if (CY_SRSS_DPLL_HP_PRESENT)

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    bool zeroTimeout = (timeoutus == 0UL);

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_HP);

    /* first set the PLL enable bit */
    SRSS_CLK_DPLL_HP_CONFIG(pllNum) |= CLK_DPLL_HP_CONFIG_ENABLE_Msk;

    /* now do the timeout wait for PLL_STATUS, bit LOCKED */
    for (; (0UL == (CLK_DPLL_HP_STATUS_LOCKED_Msk & SRSS_CLK_DPLL_HP_STATUS(pllNum))) &&
           (0UL != timeoutus);
         timeoutus--)
    {
        Cy_SysLib_DelayUs(1U);
    }

    if (zeroTimeout || (0UL != timeoutus))
    {
        /* Unbypass PLL, if it is not in AUTO mode */
        if ((uint32_t)CY_SYSCLK_FLLPLL_OUTPUT_INPUT == (uint32_t)_FLD2VAL(CLK_DPLL_HP_CONFIG_BYPASS_SEL, SRSS_CLK_DPLL_HP_CONFIG(pllNum)))
        {
            CY_REG32_CLR_SET(SRSS_CLK_DPLL_HP_CONFIG(pllNum), CLK_DPLL_HP_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
        }

        retVal = CY_SYSCLK_SUCCESS;
    }
    else
    {
        /* If lock doesn't occur, then bypass PLL */
        CY_REG32_CLR_SET(SRSS_CLK_DPLL_HP_CONFIG(pllNum), CLK_DPLL_HP_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
        /* Wait at least 6 PLL clock cycles */
        Cy_SysLib_DelayUs(1U);
        /* And now disable the PLL itself */
        SRSS_CLK_DPLL_HP_CONFIG(pllNum) &= ~CLK_DPLL_HP_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_TIMEOUT;
    }

    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}

uint32_t Cy_SysClk_DpllHpGetFrequency(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);

#if (CY_SRSS_DPLL_HP_PRESENT)
    uint32_t nDiv;
    uint32_t pDiv;
    uint32_t kDiv;
    uint32_t nDivFract;
    bool  enabled;
    uint32_t freq=0UL;

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_HP);

    cy_stc_dpll_hp_config_t    DpllHpConfig = (cy_stc_dpll_hp_config_t){0};
    cy_stc_pll_manual_config_t pllcfg = {NULL, &DpllHpConfig};

    (void)Cy_SysClk_DpllHpGetConfiguration(pllNum, &pllcfg);
    enabled  = (Cy_SysClk_DpllHpIsEnabled(pllNum)) && (CY_SYSCLK_FLLPLL_OUTPUT_INPUT != pllcfg.hpPllCfg->outputMode);
    nDiv     = (uint32_t)pllcfg.hpPllCfg->nDiv + 1U;
    pDiv     = (uint32_t)pllcfg.hpPllCfg->pDiv + 1U;
    kDiv     = (uint32_t)pllcfg.hpPllCfg->kDiv + 1U;
    nDivFract = pllcfg.hpPllCfg->nDivFract;

    if (enabled )/* If PLL is enabled and not bypassed */
    {
        freq = Cy_SysClk_ClkPathMuxGetFrequency(pllNum + SRSS_DPLL_HP_0_PATH_NUM);
        if(0U == nDivFract)
        {
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3','unsigned 64-bit int" to different or narrower essential type "unsigned 32-bit int');
            freq = (uint32_t)((uint64_t)freq * ((uint64_t)nDiv)) / (((uint64_t)pDiv) * ((uint64_t)kDiv));
        }
        else
        {
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3','unsigned 64-bit int" to different or narrower essential type "unsigned 32-bit int');
            freq = (uint32_t)((((uint64_t)freq * (((uint64_t)nDiv << SRSS_DPLL_HP_FRAC_BIT_COUNT) + (uint64_t)nDivFract)) / ((uint64_t)pDiv * (uint64_t)kDiv)) >> SRSS_DPLL_HP_FRAC_BIT_COUNT);
        }
    }

    return (freq);
#else
    return 0U;
#endif
}


#endif /* DPLL-HP */
#endif /* DPLL-LP, DPLL-HP */


bool Cy_SysClk_PllIsEnabled(uint32_t clkPath)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpIsEnabled(clkPath);
    }
    else
    {
        return Cy_SysClk_DpllHpIsEnabled(clkPath - SRSS_NUM_DPLL_LP);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));
    if(clkPath< SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpIsEnabled(clkPath);
    }
    else
    {
        return false;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

#if defined (CY_SRSS_NUM_PLL400M) && (CY_SRSS_NUM_PLL400M > 0)
    if(clkPath < CY_SRSS_NUM_PLL400M)
    {
        return Cy_SysClk_Pll400MIsEnabled(clkPath);
    }
    else
#endif
    {
        return Cy_SysClk_Pll200MIsEnabled(clkPath - CY_SRSS_NUM_PLL400M);
    }
#endif
}

bool Cy_SysClk_PllLocked(uint32_t clkPath)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpLocked(clkPath);
    }
    else
    {
        return Cy_SysClk_DpllHpLocked(clkPath - SRSS_NUM_DPLL_LP);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpLocked(clkPath);
    }
    else
    {
        return false;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

#if defined (CY_SRSS_NUM_PLL400M) && (CY_SRSS_NUM_PLL400M > 0)
    if(clkPath < CY_SRSS_NUM_PLL400M)
    {
        return Cy_SysClk_Pll400MLocked(clkPath);
    }
    else
    {
        return Cy_SysClk_Pll200MLocked(clkPath - CY_SRSS_NUM_PLL400M);
    }
#else
    return Cy_SysClk_Pll200MLocked(clkPath);
#endif
#endif
}

bool Cy_SysClk_PllLostLock(uint32_t clkPath)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpLostLock(clkPath);
    }
    else
    {
        return Cy_SysClk_DpllHpLostLock(clkPath - SRSS_NUM_DPLL_LP);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpLostLock(clkPath);
    }
    else
    {
        return false;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

