zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
#if defined (CY_SRSS_NUM_PLL400M) && (CY_SRSS_NUM_PLL400M > 0)
    if(clkPath < CY_SRSS_NUM_PLL400M)
    {
        return Cy_SysClk_Pll400MLostLock(clkPath);
    }
    else
    {
        return Cy_SysClk_Pll200MLostLock(clkPath - CY_SRSS_NUM_PLL400M);
    }
#else
    return Cy_SysClk_Pll200MLostLock(clkPath);
#endif
#endif
}

cy_en_sysclk_status_t Cy_SysClk_PllDisable(uint32_t clkPath)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpDisable(clkPath);
    }
    else
    {
        return Cy_SysClk_DpllHpDisable(clkPath - SRSS_NUM_DPLL_LP);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpDisable(clkPath);
    }
    else
    {
        return CY_SYSCLK_BAD_PARAM;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

#if defined (CY_SRSS_NUM_PLL400M) && (CY_SRSS_NUM_PLL400M > 0)
    if(clkPath < CY_SRSS_NUM_PLL400M)
    {
        return Cy_SysClk_Pll400MDisable(clkPath);
    }
    else
    {
        return Cy_SysClk_Pll200MDisable(clkPath - CY_SRSS_NUM_PLL400M);
    }
#else
    return Cy_SysClk_Pll200MDisable(clkPath);
#endif
#endif
}


cy_en_sysclk_status_t Cy_SysClk_PllConfigure(uint32_t clkPath, const cy_stc_pll_config_t *config)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpConfigure(clkPath, config);
    }
    else
    {
        return Cy_SysClk_DpllHpConfigure(clkPath - SRSS_NUM_DPLL_LP, config);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpConfigure(clkPath, config);
    }
    else
    {
        return CY_SYSCLK_BAD_PARAM;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

#if defined (CY_SRSS_NUM_PLL400M) && (CY_SRSS_NUM_PLL400M > 0)
    if(clkPath < CY_SRSS_NUM_PLL400M)
    {
        return Cy_SysClk_Pll400MConfigure(clkPath, config);
    }
    else
    {
        return Cy_SysClk_Pll200MConfigure((clkPath - CY_SRSS_NUM_PLL400M), config);
    }
#else
    return Cy_SysClk_Pll200MConfigure(clkPath, config);
#endif
#endif
}

cy_en_sysclk_status_t Cy_SysClk_PllManualConfigure(uint32_t clkPath, const cy_stc_pll_manual_config_t *config)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpManualConfigure(clkPath, config);
    }
    else
    {
        return Cy_SysClk_DpllHpManualConfigure(clkPath - SRSS_NUM_DPLL_LP, config);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpManualConfigure(clkPath, config);
    }
    else
    {
        return CY_SYSCLK_BAD_PARAM;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

#if defined (CY_SRSS_NUM_PLL400M) && (CY_SRSS_NUM_PLL400M > 0)
    if(clkPath < CY_SRSS_NUM_PLL400M)
    {
        return Cy_SysClk_Pll400MManualConfigure(clkPath, config);
    }
    else
    {
        return Cy_SysClk_Pll200MManualConfigure((clkPath - CY_SRSS_NUM_PLL400M), config);
    }
#else
    return Cy_SysClk_Pll200MManualConfigure(clkPath, config);
#endif
#endif
}

cy_en_sysclk_status_t Cy_SysClk_PllGetConfiguration(uint32_t clkPath, cy_stc_pll_manual_config_t *config)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpGetConfiguration(clkPath, config);
    }
    else
    {
        return Cy_SysClk_DpllHpGetConfiguration(clkPath - SRSS_NUM_DPLL_LP, config);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpGetConfiguration(clkPath, config);
    }
    else
    {
        return CY_SYSCLK_BAD_PARAM;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

#if defined (CY_SRSS_NUM_PLL400M) && (CY_SRSS_NUM_PLL400M > 0)
    if(clkPath < CY_SRSS_NUM_PLL400M)
    {
        return Cy_SysClk_Pll400MGetConfiguration(clkPath, config);
    }
    else
    {
        return Cy_SysClk_Pll200MGetConfiguration((clkPath - CY_SRSS_NUM_PLL400M), config);
    }
#else
    return Cy_SysClk_Pll200MGetConfiguration(clkPath, config);
#endif
#endif
}

cy_en_sysclk_status_t Cy_SysClk_PllEnable(uint32_t clkPath, uint32_t timeoutus)
{
#if defined(CY_IP_MXS22SRSS)
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpEnable(clkPath, timeoutus);
    }
    else
    {
        return Cy_SysClk_DpllHpEnable(clkPath - SRSS_NUM_DPLL_LP, timeoutus);
    }
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

    if(clkPath < SRSS_NUM_DPLL_LP)
    {
        return Cy_SysClk_DpllLpEnable(clkPath, timeoutus);
    }
    else
    {
        return CY_SYSCLK_BAD_PARAM;
    }
#else
    clkPath--; /* to correctly access PLL config and status registers structures */
    CY_ASSERT_L1(clkPath < (CY_SRSS_NUM_PLL));

