zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
    hfNum = Cy_Sysclk_PeriPclkGetClkHfNum((uint32_t)ipBlock);
#endif

#if (defined (CY_IP_MXS40SRSS) && (defined (CY_IP_MXPERI) && (CY_IP_MXPERI_VERSION < 3U)))
        CY_ASSERT_L1(((dividerType == CY_SYSCLK_DIV_8_BIT)    && (dividerNum < PERI_PCLK_GR_DIV_8_NR(instNum, grpNum)))    || \
                     ((dividerType == CY_SYSCLK_DIV_16_BIT)   && (dividerNum < PERI_PCLK_GR_DIV_16_NR(instNum, grpNum)))   || \
                     ((dividerType == CY_SYSCLK_DIV_24_5_BIT) && (dividerNum < PERI_PCLK_GR_DIV_24_5_NR(instNum, grpNum))));
#else
        CY_ASSERT_L1(((dividerType == CY_SYSCLK_DIV_8_BIT)    && (dividerNum < PERI_PCLK_GR_DIV_8_NR(instNum, grpNum)))    || \
                     ((dividerType == CY_SYSCLK_DIV_16_BIT)   && (dividerNum < PERI_PCLK_GR_DIV_16_NR(instNum, grpNum)))   || \
                     ((dividerType == CY_SYSCLK_DIV_16_5_BIT) && (dividerNum < PERI_PCLK_GR_DIV_16_5_NR(instNum, grpNum))) || \
                     ((dividerType == CY_SYSCLK_DIV_24_5_BIT) && (dividerNum < PERI_PCLK_GR_DIV_24_5_NR(instNum, grpNum))));
#endif


#if !(defined (CY_IP_MXPERI) && (CY_IP_MXPERI_VERSION <= 2))
    if(hfNum != CY_SYSCLK_INVALID_HF_NUM)
#endif
    {
        freq = Cy_SysClk_ClkHfGetFrequency(hfNum); /* Get CLK_HF* frequency */
#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)
        /* get the peri clock tree frequency */
        freq = CY_SYSLIB_DIV_ROUND(freq, peri_div);
#endif
        /* get the divider value for clk_peri to the selected peripheral clock */
        switch(dividerType)
        {
            case CY_SYSCLK_DIV_8_BIT:
            case CY_SYSCLK_DIV_16_BIT:
                integer = 1UL + Cy_SysClk_PeriPclkGetDivider(ipBlock, dividerType, dividerNum);
                freq = CY_SYSLIB_DIV_ROUND(freq, integer);
                break;

            case CY_SYSCLK_DIV_16_5_BIT:
            case CY_SYSCLK_DIV_24_5_BIT:
                {
                    uint32_t locFrac = 0;
                    uint32_t locDiv = 0;
                    uint64_t locFreq = freq * 32ULL;
                    Cy_SysClk_PeriPclkGetFracDivider(ipBlock, dividerType, dividerNum, &integer, &locFrac);
                    /* For fractional dividers, the divider is (int + 1) + frac/32 */
                    locDiv = ((1UL + integer) * 32UL) + locFrac;
                    freq = (uint32_t) CY_SYSLIB_DIV_ROUND(locFreq, (uint64_t)locDiv);
                }
                break;

            default:
                /* Unknown Divider */
                break;
        }
    }
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(instNum); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(grpNum); /* Suppress a compiler warning about unused variables */

    return (freq);
}
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 18.1')


/* ========================================================================== */
/* ===========================    CLKPWR SECTION    =========================== */
/* ========================================================================== */
#if (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL))

void Cy_SysClk_ClkPwrSetDivider(uint32_t divider)
{
    if (CY_SYSCLK_IS_CLKPWR_DIVIDER_VALID(divider))
    {
        CY_REG32_CLR_SET(PWRMODE_PWR_SELECT, PWRMODE_CLK_SELECT_CLK_PWR_DIV, divider - 1UL);
    }
}


uint32_t Cy_SysClk_ClkPwrGetDivider(void)
{
    return ((1UL + _FLD2VAL(PWRMODE_CLK_SELECT_CLK_PWR_DIV, PWRMODE_PWR_SELECT)));
}

uint32_t Cy_SysClk_ClkPwrGetFrequency(void)
{
    uint32_t pwrFreq = 0UL, pwrDiv;

      /* Get the frequency of the source */
        switch(Cy_SysClk_ClkPwrGetSource())
        {
            case CY_SYSCLK_CLKPWR_IN_IMO: /* The IMO frequency is fixed at 8 MHz */
                pwrFreq = CY_SYSCLK_IMO_FREQ;
                break;

            case CY_SYSCLK_CLKPWR_IN_IHO:
                pwrFreq = CY_SYSCLK_IHO_FREQ;
                break;

            default:
                /* Don't know the frequency of dsi_out, leave freq = 0UL */
                break;
        }

    pwrDiv = Cy_SysClk_ClkPwrGetDivider(); /* clkPwr prescaler (1-256) */

    /* Divide the path input frequency down and return the result */
    return (CY_SYSLIB_DIV_ROUND(pwrFreq, pwrDiv));
}


void Cy_SysClk_ClkPwrSetSource(cy_en_clkpwr_in_sources_t source)
{
    CY_ASSERT_L3(CY_SYSCLK_IF_CLKPWR_SOURCE_VALID(source));
    CY_REG32_CLR_SET(PWRMODE_PWR_SELECT, PWRMODE_CLK_SELECT_CLK_PWR_MUX, source);
}


cy_en_clkpwr_in_sources_t Cy_SysClk_ClkPwrGetSource(void)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_clkpwr_in_sources_t enum.');
    return ((cy_en_clkpwr_in_sources_t)(_FLD2VAL(PWRMODE_CLK_SELECT_CLK_PWR_MUX, PWRMODE_PWR_SELECT)));
}

#endif


#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) && defined(SRSS_CSV_REF_CSV_REF_CTL))

/* ========================================================================== */
/* ===========================    CSV_REF SECTION  ========================== */
/* ========================================================================== */

uint32_t Cy_SysClk_ClkRefGetFrequency(void)
{
    uint32_t freq;
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_clkhf_csv_ref_clk_t enum.');
    cy_en_clkhf_csv_ref_clk_t monSrc = (cy_en_clkhf_csv_ref_clk_t) _FLD2VAL(SRSS_CSV_REF_SEL_REF_MUX, SRSS_CSV_REF_SEL);
    freq = Cy_SysClk_ClkHfCsvGetRefFrequency(monSrc);

    return (freq);
}

uint32_t Cy_SysClk_ClkRefCsvGetRefFrequency(cy_en_clkref_csv_ref_clk_t refClk)
 {
    uint32_t freq = 0UL;

    /* Get the frequency of the source  */
    switch(refClk)
     {
        case CY_SYSCLK_CLKREF_CSV_REF_ILO0:
            freq = (0UL != (SRSS_CLK_ILO0_CONFIG & SRSS_CLK_ILO0_CONFIG_ENABLE_Msk)) ? CY_SYSCLK_ILO_FREQ : 0UL;
            break;
        default:
            /* Don't know the frequency of dsi_out, leave freq = 0UL */
            break;
     }
    return (freq);
 }


