zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
cy_en_sysclk_status_t Cy_SysClk_ClkRefCsvManualConfigure(cy_en_clkref_csv_ref_clk_t refClk, const cy_stc_clkref_csv_manual_config_t * csvConfig)
{
    /* Check for errors */
    CY_ASSERT_L1(csvConfig != NULL);

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint32_t monitorFreq = Cy_SysClk_ClkRefGetFrequency();
    uint32_t refFreq = Cy_SysClk_ClkRefCsvGetRefFrequency(refClk);
    float32_t f_monitorFreq = (float32_t) monitorFreq;
    float32_t f_refFreq = (float32_t) refFreq;

    CY_ASSERT_L1(csvConfig->upperLimit > CSV_MIN_TARGET_VAL);
    CY_ASSERT_L1(csvConfig->lowerLimit < csvConfig->upperLimit -1UL);
    CY_ASSERT_L1(monitorFreq > 0UL);
    CY_ASSERT_L1((int32_t) csvConfig->startTime >= (((int32_t)(((float32_t)(csvConfig->period +3UL)) * (f_refFreq / f_monitorFreq))) - ((int32_t)csvConfig->upperLimit)));

    (void) monitorFreq; /* Used only in Assert comparison. */
    (void) refFreq;  /* Used only in Assert comparison.  */
    (void) f_monitorFreq; /* Used only in Assert comparison. */
    (void) f_refFreq;  /* Used only in Assert comparison.  */

    CY_REG32_CLR_SET(SRSS_CSV_REF_CSV_REF_CTL, CSV_REF_CSV_REF_CTL_CSV_STARTUP, csvConfig->startTime - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_REF_CSV_REF_LIMIT, CSV_REF_CSV_REF_LIMIT_CSV_LOWER, csvConfig->lowerLimit - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_REF_CSV_REF_LIMIT, CSV_REF_CSV_REF_LIMIT_CSV_UPPER, csvConfig->upperLimit - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_REF_CSV_MON_CTL, CSV_REF_CSV_MON_CTL_CSV_PERIOD, csvConfig->period - 1UL);
    retVal = CY_SYSCLK_SUCCESS;

    return retVal;
}


cy_en_sysclk_status_t Cy_SysClk_ClkRefCsvConfigure(cy_en_clkref_csv_ref_clk_t refClk, uint32_t accuracy)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    cy_stc_clkref_csv_manual_config_t csvConfig= {0, 0, 0, 0};

    float32_t target = (float32_t) CSV_MIN_TARGET_VAL;
    uint32_t monitorFreq = Cy_SysClk_ClkRefGetFrequency();
    uint32_t refFreq = Cy_SysClk_ClkRefCsvGetRefFrequency(refClk);
    float32_t f_monitorFreq = (float32_t) monitorFreq;
    float32_t f_refFreq = (float32_t) refFreq;

    CY_ASSERT_L1(monitorFreq > 0UL);

    if(monitorFreq > 0UL && refFreq > 0UL)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.lowerLimit = (uint32_t) ((float32_t)target - (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F)));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.upperLimit = (uint32_t) ((float32_t)target + (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F)));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.period =  (uint32_t) (((float32_t) target) / (f_refFreq / f_monitorFreq));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.startTime = (uint32_t) ((((float32_t)(csvConfig.period + 3UL)) * (f_refFreq / f_monitorFreq))
                                + (CSV_MIN_STARTUP_DELAY * f_refFreq)
                                + (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F))) + 1U;

        retVal= Cy_SysClk_ClkRefCsvManualConfigure(refClk, &csvConfig);
    }

    return retVal;
}


void Cy_SysClk_ClkRefCsvAction(cy_en_clkref_csv_action_t action)
{
    CY_REG32_CLR_SET(SRSS_CSV_REF_CSV_REF_CTL, CSV_REF_CSV_REF_CTL_CSV_ACTION, action);
}


void Cy_SysClk_ClkRefCsvEnable(void)
{
    CY_REG32_CLR_SET(SRSS_CSV_REF_CSV_REF_CTL, CSV_REF_CSV_REF_CTL_CSV_EN, 1U);
}


void Cy_SysClk_ClkRefCsvDisable(void)
{
    CY_REG32_CLR_SET(SRSS_CSV_REF_CSV_REF_CTL, CSV_REF_CSV_REF_CTL_CSV_EN, 0U);
}


bool Cy_SysClk_IsClkRefCsvEnabled(void)
{
    return (0UL != (SRSS_CSV_REF_CSV_REF_CTL & CSV_REF_CSV_REF_CTL_CSV_EN_Msk));
}
#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) && defined(SRSS_CSV_REF_CSV_REF_CTL)) */

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) && defined(SRSS_CSV_ILO_CSV_REF_CTL))

/* ========================================================================== */
/* ===========================    CSV_ILO SECTION  ========================== */
/* ========================================================================== */

uint32_t Cy_SysClk_ClkIloGetFrequency(void)
{
    uint32_t freq = 0UL;
    if (0UL != (SRSS_CLK_ILO0_CONFIG & SRSS_CLK_ILO0_CONFIG_ENABLE_Msk)) {
       freq = CY_SYSCLK_ILO_FREQ;
    }
    return (freq);
}

uint32_t Cy_SysClk_ClkIloCsvGetRefFrequency(cy_en_clkilo_csv_ref_clk_t refClk)
 {
    uint32_t freq;
    (void) refClk; /* Not used */

    freq =  Cy_SysClk_ClkLfGetFrequency();

    return (freq);
 }


cy_en_sysclk_status_t Cy_SysClk_ClkIloCsvManualConfigure(cy_en_clkilo_csv_ref_clk_t refClk, const cy_stc_clkilo_csv_manual_config_t * csvConfig)
{
    /* Check for errors */
    CY_ASSERT_L1(csvConfig != NULL);

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint32_t monitorFreq = Cy_SysClk_ClkIloGetFrequency();
    uint32_t refFreq = Cy_SysClk_ClkIloCsvGetRefFrequency(refClk);
    float32_t f_monitorFreq = (float32_t) monitorFreq;
    float32_t f_refFreq = (float32_t) refFreq;


    CY_ASSERT_L1(csvConfig->upperLimit > CSV_MIN_TARGET_VAL);
    CY_ASSERT_L1(csvConfig->lowerLimit < csvConfig->upperLimit -1UL);
    CY_ASSERT_L1(monitorFreq > 0UL);
    CY_ASSERT_L1((int32_t) csvConfig->startTime >= (((int32_t)(((float32_t)(csvConfig->period +3UL)) * (f_refFreq / f_monitorFreq))) - ((int32_t)csvConfig->upperLimit)));

    (void) monitorFreq; /* Used only in Assert comparison. */
    (void) refFreq;  /* Used only in Assert comparison.  */
    (void) f_monitorFreq; /* Used only in Assert comparison. */
    (void) f_refFreq;  /* Used only in Assert comparison.  */

    CY_REG32_CLR_SET(SRSS_CSV_ILO_CSV_REF_CTL, CSV_ILO_CSV_REF_CTL_CSV_STARTUP, csvConfig->startTime - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_ILO_CSV_REF_LIMIT, CSV_ILO_CSV_REF_LIMIT_CSV_LOWER, csvConfig->lowerLimit - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_ILO_CSV_REF_LIMIT, CSV_ILO_CSV_REF_LIMIT_CSV_UPPER, csvConfig->upperLimit - 1UL);
    CY_REG32_CLR_SET(SRSS_CSV_ILO_CSV_MON_CTL, CSV_ILO_CSV_MON_CTL_CSV_PERIOD, csvConfig->period - 1UL);
    retVal = CY_SYSCLK_SUCCESS;

    return retVal;
}


