zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysclk_v2.c
cy_en_sysclk_status_t Cy_SysClk_ClkIloCsvConfigure(cy_en_clkilo_csv_ref_clk_t refClk, uint32_t accuracy)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    cy_stc_clkilo_csv_manual_config_t csvConfig= {0, 0, 0, 0};

    uint32_t target = CSV_MIN_TARGET_VAL;
    uint32_t monitorFreq = Cy_SysClk_ClkIloGetFrequency();
    uint32_t refFreq = Cy_SysClk_ClkIloCsvGetRefFrequency(refClk);
    float32_t f_monitorFreq = (float32_t) monitorFreq;
    float32_t f_refFreq = (float32_t) refFreq;

    CY_ASSERT_L1(monitorFreq > 0UL);

    if(monitorFreq > 0UL && refFreq > 0UL)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.lowerLimit = (uint32_t) ((float32_t)target - (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F)));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.upperLimit = (uint32_t) ((float32_t)target + (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F)));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.period =  (uint32_t) ((float32_t)target / (f_refFreq / f_monitorFreq));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to uint32_t.');
        csvConfig.startTime = (uint32_t) ((((float32_t)(csvConfig.period + 3UL)) * (f_refFreq / f_monitorFreq))
                                + (CSV_MIN_STARTUP_DELAY * f_refFreq)
                                + (((float32_t)CSV_MIN_TARGET_VAL / 100.0F) * ((float32_t)accuracy / 2.0F))) + 1U;

        retVal= Cy_SysClk_ClkIloCsvManualConfigure(refClk, &csvConfig);
    }

    return retVal;
}


void Cy_SysClk_ClkIloCsvEnable(void)
{
    CY_REG32_CLR_SET(SRSS_CSV_ILO_CSV_REF_CTL, CSV_ILO_CSV_REF_CTL_CSV_EN, 1U);
}


void Cy_SysClk_ClkIloCsvDisable(void)
{
    CY_REG32_CLR_SET(SRSS_CSV_ILO_CSV_REF_CTL, CSV_ILO_CSV_REF_CTL_CSV_EN, 0U);
}


bool Cy_SysClk_IsClkIloCsvEnabled(void)
{
    return (0UL != (SRSS_CSV_ILO_CSV_REF_CTL & CSV_ILO_CSV_REF_CTL_CSV_EN_Msk));
}

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) && defined(SRSS_CSV_ILO_CSV_REF_CTL)) */

#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_IP_MXS22SRSS) */
/* [] END OF FILE */
